[
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=112994&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_3c83ee5f&cb=1560102001183&jobListingId=3258995261",
    "title": "Android Software Developer (Contract)",
    "description": "We’re always looking for passionate software developers to contract with us on projects. Our current preferences for a contract developer include:\nNative Android development experience (Java and/or Kotlin)\nLocated in the Seattle, WA area\nHere’s a more general description of what you’ll do and the basic requirements for joining us under any contract:\n\nAs a Developer, you'll be contributing to the successful delivery of digital products. You articulate the objective rationale behind your coding decisions, working with your teammates to ensure those align with business and audience needs. You'll be switching between setting direction, creating software, and helping your teams constantly improve. You handle it with ease through solid time management skills, enthusiastic client services, and an inspiring attitude. You thoughtfully apply the latest tools, trends, and practices of the development alongside those that are more tried-and-true.\n\nIn your day-to-day you will:\nCollaborate with your project team to evaluate a product experience holistically, identify next steps and deliver the individual features that make up the product\nObjectively explain and represent your contributions and deliverables to your team and client\nClearly communicate with your project team to make sure they have full context of your work and that you have the same of theirs, jumping in on other tasks as needed\nTake on various tasks, development-related or not, to support different processes and needs on your project teams\nCollaborate directly every day with designers, developers, engagement managers, and clients\nRequirements\n\nYou are an ambitious developer\n\nYou don't believe in resting on your laurels and easily tackle situations of ambiguity to figure out how to keep yourself and your work moving forward.\n\nYou are a collaborative project contributor\n\nYou work together with your project team to understand, act, and deliver on next steps translated from product and client needs.\n\nYou are an adaptive contributor\n\nYou're eager to jump in on tasks to support your team as needed, with no ego or complaints.\n\nYou are a student of business and development practices\n\nYou want to constantly improve client service, business, and software development practices in yourself and your team.\n\nExperience\n3+ years of software development experience (ideally w/experience in a client services or agency environment)\nProficiency w/i development (ex. primarily Java and Kotlin, but Xamarin, React Native, etc. are also nice-to-haves)\nStrong communication, client services, and interpersonal skills\nFierce passion about collaboration and the way you develop software\nUnderstanding of integrated development practices and experience directly collaborating with design teams\nExperience or familiarity solving problems across multiple technology platforms (eg. browsers, applications, operating systems, mobile and connected devices, other hardware)\n(Preferred) Demonstrated practice w/test-driven/behavior-driven product development",
    "location": "Seattle, WA",
    "employer": "Substantial"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=112994&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_92cbffdc&cb=1560102001186&jobListingId=3258995265",
    "title": "iOS Software Developer (Contract)",
    "description": "We’re always looking for passionate software developers to contract with us on projects. Projects vary in terms of industry, breadth, and duration so we’re continuously looking to build a roster of people with a variety of expertise and availability. If your experience doesn’t match with our current needs we’re happy to keep you in mind as new opportunities arise.\n\nFor some opportunities we’re looking to fit a specific set of skills or qualities. Our current preferences for a contract developer include:\nNative iOS development experience (Objective-C and/or Swift)\nLocated in the Seattle, WA area\nHere’s a more general description of what you’ll do and the basic requirements for joining us under any contract:\n\nAs a Developer, you'll be contributing to the successful delivery of digital products. You articulate the objective rationale behind your coding decisions, working with your teammates to ensure those align with business and audience needs. You'll be switching between setting direction, creating software, and helping your teams constantly improve. You handle it with ease through solid time management skills, enthusiastic client services, and an inspiring attitude. You thoughtfully apply the latest tools, trends, and practices of the development alongside those that are more tried-and-true.\n\nIn your day-to-day you will:\nCollaborate with your project team to evaluate a product experience holistically, identify next steps and deliver the individual features that make up the product\nObjectively explain and represent your contributions and deliverables to your team and client\nClearly communicate with your project team to make sure they have full context of your work and that you have the same of theirs, jumping in on other tasks as needed\nTake on various tasks, development-related or not, to support different processes and needs on your project teams\nCollaborate directly every day with designers, developers, engagement managers, and clients\nRequirements\n\nYou are an ambitious developer\n\nYou don't believe in resting on your laurels and easily tackle situations of ambiguity to figure out how to keep yourself and your work moving forward.\n\nYou are a collaborative project contributor\n\nYou work together with your project team to understand, act, and deliver on next steps translated from product and client needs.\n\nYou are an adaptive contributor\n\nYou're eager to jump in on tasks to support your team as needed, with no ego or complaints.\n\nYou are a student of business and development practices\n\nYou want to constantly improve client service, business, and software development practices in yourself and your team.\n\nExperience\n3+ years of software development experience (ideally w/experience in a client services or agency environment)\nProficiency w/iOS development (ex. primarily Swift and Objective-C, but Xamarin, React Native, etc. are also nice-to-haves)\nStrong communication, client services, and interpersonal skills\nFierce passion about collaboration and the way you develop software\nUnderstanding of integrated development practices and experience directly collaborating with design teams\nExperience or familiarity solving problems across multiple technology platforms (eg. browsers, applications, operating systems, mobile and connected devices, other hardware)\n(Preferred) Demonstrated practice w/test-driven/behavior-driven product development",
    "location": "Seattle, WA",
    "employer": "Substantial"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=133794&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_063f91f1&cb=1560102001193&jobListingId=3226559159",
    "title": "Software Developer - Instrumentation",
    "description": "Hulu is a premium streaming TV destination that seeks to captivate and connect viewers with the stories they love. We create amazing experiences that celebrate the best of entertainment and technology. We’re looking for great people who are passionate about redefining TV through innovation, unconventional thinking and embracing fun. It’s a mission that takes some serious smarts, intense curiosity and determination to be the best. Come be part of the team that’s powering play.\n\nSUMMARY\n\nWe are seeking a Software Developer to join our growing team. The Product Instrumentation team is responsible for improving the accuracy, consistency, and utility of data reported from Hulu's client applications. Your work will streamline how Hulu tracks user behavior data, allowing Hulu to develop the right products and features and make the right business decisions. On this team, you could write code for the Hulu Android application one day and the next day you could work on a service that tests data quality for billions of data points. Does the idea of working across all aspects and teams of Hulu interest you? Do you love learning something new every single day? If you are the curious type who loves collaborating, then this is an excellent role for you.\n\nWHAT YOU’LL DO\nDesign and build the next generation instrumentation platform\nMaintain instrumentation SDKs for different devices and web applications\nWork with teams across the Hulu tech stack to integrate instrumentation services and SDKs into their applications and services\nWork with our partners to define instrumentation specifications\nWHAT TO BRING\n3+ years of software development experience\n2+ years of experience writing JavaScript or TypeScript\nExperience building NodeJS/Express services\nA real passion for test-driven development\nA strong grasp of computer science fundamentals (data structures, algorithms, etc.)\nGreat communication and teamwork skills\nBachelor’s degree in computer science or related field\nNICE-TO-HAVES\nExperience with open-source datastores like Redis, MySQL, Couchbase, or Hive\nExperience building web UIs with React\nExperience using other consumer analytics tools like Google Analytics or Tealium\nFamiliar with data profiling tools and data quality practices\nExperience with mobile and living room device development\n*LI-AC1",
    "location": "Seattle, WA",
    "employer": "Hulu"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=37049&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_e2da86b3&cb=1560102001194&jobListingId=3190208325",
    "title": "Web Software Developer (Python/React)",
    "description": "The Walt Disney Company is a world-class entertainment and technology leader. Walts passion was to continuously envision new ways to move audiences around the worlda passion that remains our touchstone in an enterprise that stretches from: animation, theme parks, resorts and a cruise line to sports, news, movies and a variety of other businesses. Uniting each endeavor is a commitment to creating and delivering unforgettable experiences and were constantly looking for new ways to enhance these exciting experiences. Part of the Disney ABC Television Group, Disney Television Animation is a high capacity digital animation television production studio. Because of Disney Television Animations strong use of commercial and custom software technologies to create its animation products, its use of technology, engineering, development techniques and software is critical to its production operations and workflows.\n\nThe Web Software Developer is responsible for designing and developing web based code/software solutions and maintaining existing web based code/software for the Disney Television Animation business unit.\n\nResponsibilities :\nA high level breakdown of the Web Software Developers responsibilities follows:\nInteracting with departmental and production staff as required\nAnalyzing production software procedures and problems\nEvaluating the effectiveness of existing software solutions\nAssist with identifying opportunities to improve: production software output, efficiency, and workflow\nSoftware analysis and design\nCode testing / integration\nHigh level support of developed code\nThe Web Software Developer partners with the technology departments management, department staff and production personnel to determine software engineering needs. Additionally, the WBSD reviews existing software system capabilities to decide what changes can be made within existing systems and when new systems must be added to provide solutions - whichever meets productions need in the timeliest manner and fits within the specific budget.\n\nThe Web Software Developer is responsive to our environments critical production timelines and is able to analyze bugs/ system glitches, track them to the corrupted code, implement timely repairs, and make recommendations for avoiding similar situations via code/software/system changes and code management procedures.\n\nBasic Qualifications :\n2 years + (or a combination of work experience and advanced education) working in a web based software development environment with a demonstrated competency in delivering advanced software applications and solutions.\nA portfolio of demonstrated web based solutions.\nMust be able to work independently with technical and non-technical staff to determine web based system design, modification and support needs.\nStrong written documentation skills and possess creativity in developing easy-to-use tools and quick fixes.\nMust be experienced, understanding a range of development languages / platforms and operating systems:\nExperience working with backend frameworks in Python, PHP, or NodeJS\nExperience working with frontend libraries: React, Vue or Angular\nExperience working in a TDD, BDD or another unit testing driven environment\nExperience developing with Docker\nExperience designing RESTful APIs\nExperience with databases: MySQL, Redis, etc.\nExperience with version control: Git\nFamiliarity with web servers: Apache, Nginx, etc.\nFamiliarity with Cloud Providers (AWS, Azure or GCP)\nFamiliarity with common Software Engineering Design Patterns\nMobile development experience is a plus but not required\nExperience working with networking environments.\nAble to communicate technical information effectively both written and verbally.\nAbility to strategically solve complex technical issues.\nAbility to work in a fast paced, production critical environment.\nMust be well organized and detailed oriented.\nRequired Education :\nBachelors degree in a technical discipline.\n",
    "location": "Glendale, CA",
    "employer": "Walt Disney Company"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=191997&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_409262d7&cb=1560102001195&jobListingId=3188875671",
    "title": "Web Software Developer (Python/React)",
    "description": "Job ID\n654595BR\n\nLocation\n\nGlendale, California, United States\n\nBusiness\nDisney Television Animation\n\nDate posted\nApr. 10, 2019\n\nJob Summary: The Walt Disney Company is a world-class entertainment and technology leader. Walt’s passion was to continuously envision new ways to move audiences around the world—a passion that remains our touchstone in an enterprise that stretches from: animation, theme parks, resorts and a cruise line to sports, news, movies and a variety of other businesses. Uniting each endeavor is a commitment to creating and delivering unforgettable experiences — and we’re constantly looking for new ways to enhance these exciting experiences. Part of the Disney ABC Television Group, Disney Television Animation is a high capacity digital animation television production studio. Because of Disney Television Animation’s strong use of commercial and custom software technologies to create its animation products, its use of technology, engineering, development techniques and software is critical to its production operations and workflows.\n\nThe Web Software Developer is responsible for designing and developing web based code/software solutions and maintaining existing web based code/software for the Disney Television Animation business unit.\nResponsibilities:A high level breakdown of the Web Software Developer’s responsibilities follows:\nInteracting with departmental and production staff as required\nAnalyzing production software procedures and problems\nEvaluating the effectiveness of existing software solutions\nAssist with identifying opportunities to improve: production software output, efficiency, and workflow\nSoftware analysis and design\nCode testing / integration\nHigh level support of developed code\nThe Web Software Developer partners with the technology department’s management, department staff and production personnel to determine software engineering needs. Additionally, the WBSD reviews existing software system capabilities to decide what changes can be made within existing systems and when new systems must be added to provide solutions - whichever meets productions need in the timeliest manner and fits within the specific budget.\n\nThe Web Software Developer is responsive to our environment’s critical production timelines and is able to analyze bugs/ system glitches, track them to the corrupted code, implement timely repairs, and make recommendations for avoiding similar situations via code/software/system changes and code management procedures.\nBasic Qualifications:\n\n2 years + (or a combination of work experience and advanced education) working in a web based software development environment with a demonstrated competency in delivering advanced software applications and solutions.\nA portfolio of demonstrated web based solutions.\nMust be able to work independently with technical and non-technical staff to determine web based system design, modification and support needs.\nStrong written documentation skills and possess creativity in developing easy-to-use tools and “quick fixes”.\nMust be experienced, understanding a range of development languages / platforms and operating systems:\nExperience working with backend frameworks in Python, PHP, or NodeJS\nExperience working with frontend libraries: React, Vue or Angular\nExperience working in a TDD, BDD or another unit testing driven environment\nExperience developing with Docker\nExperience designing RESTful APIs\nExperience with databases: MySQL, Redis, etc.\nExperience with version control: Git\nFamiliarity with web servers: Apache, Nginx, etc.\nFamiliarity with Cloud Providers (AWS, Azure or GCP)\nFamiliarity with common Software Engineering Design Patterns\nMobile development experience is a plus but not required\nExperience working with networking environments.\nAble to communicate technical information effectively – both written and verbally.\nAbility to strategically solve complex technical issues.\nAbility to work in a fast paced, production critical environment.\nMust be well organized and detailed oriented.\nRequired Education\nBachelor’s degree in a technical discipline.\n\nAbout Disney Television Animation:\n\nDisney Television Animation loves characters. Characters reveal our deepest emotions and what it means to be human… even if you're an animated duck, mouse, muppet, lion, boy or girl. Are you the type of character that loves animation and wants to be part of the team that makes the magic happen? Disney Television Animation, an integral part of The Walt Disney Company, creates many of the company's most beloved animated shows. If you've got a passion to join our team of talented professionals, we want to hear your story.\n\nAbout The Walt Disney Company:\n\nThe Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise with the following business segments: media networks, parks and resorts, studio entertainment, consumer products and interactive media. From humble beginnings as a cartoon studio in the 1920s to its preeminent name in the entertainment industry today, Disney proudly continues its legacy of creating world-class stories and experiences for every member of the family. Disney’s stories, characters and experiences reach consumers and guests from every corner of the globe. With operations in more than 40 countries, our employees and cast members work together to create entertainment experiences that are both universally and locally cherished.\n\nThis position is with Walt Disney Pictures, which is part of a business segment we call Disney Television Animation.\n\nWalt Disney Pictures is an equal opportunity employer. Applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Disney fosters a business culture where ideas and decisions from all people help us grow, innovate, create the best stories and be relevant in a rapidly changing world.\n\nApply Now\n",
    "location": "Glendale, CA",
    "employer": "Disney Television Animation"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=312400&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_e119e443&cb=1560102001198&jobListingId=3226691208",
    "title": "Software Developer Intern",
    "description": "Picture Yourself as BlenderBottle's New\n\nSoftware Developer Intern\n\nBeyond the Bottle\n\nA career at BlenderBottle is not about punching the clock. It's about embracing exciting and fast-paced opportunities that sharpen your skills, drive innovation, and play an integral role in growing a global brand. Your work will not only impact the company, it will impact the lives of millions of people around the world. When you step up to a career at BlenderBottle Company, you step up to cutting-edge. You sign up for bold action and invigorating synergy. You agree to face'and break through'new challenges every day.\n\nAs a Software Developer Intern, your primary responsibility involves taking designs and ideas and bringing them to life. You will see projects through the phases of pre-production and ideation, collaboration with design, building, tests, and validation. Every day will bring new opportunities to simplify and improve the lives of those who use our products.\n\nHow We'll Help You Succeed\n\nOur culture is passionate, entrepreneurial, and energetic. We innovate. We collaborate. We strive for excellence. We recognize. We celebrate. We connect. We host athletic events, seasonal celebrations, and team-building activities to create unity and reward accomplishment. Bottom line? You'll love it here.\nComprehensive medical, dental, and vision care\n401k package with employer matching\nPaid Time Off\nMaternity/Paternity leave\nFull indoor basketball/volleyball court\nFully equipped fitness center (cardio, weights, functional fitness area, lockers and showers, etc.)\nYoga studio\nMeditation/Nap room\nAnd much more!\nHow You'll Make an Impact\n\nEvery role at BlenderBottle is critical to our successful functioning as a whole. Your specific responsibilities as a part of our team will include:\nCollaborate with stakeholders and other developers to build, release, and maintain software (including web) applications\nTroubleshoot and fix bugs, write and maintain automated unit and system-level tests\nDevelop and support improvements to operating infrastructure, including security improvements or transitions to elastic/ \"cloud\"-based infrastructure\nMake project time-to-complete estimates, follow up by tracking project time and tasks in project management software\n\n\nWhat You'll Bring to the Team\n\nWe seek employees who are adept at contributing their personal expertise to a collaborative work environment. For this role, we're looking for someone with the following skills and experience:\nProficient development skills in HTML, CSS, Javascript, with experience in Node JS and React being preferred\nExperience with Shopify a plus\nStrong SQL knowledge and experience (preferred MSSQL)\nExperience with cloud infrastructure (AWS)\nExperience with GraphQL, APIs, Docker/Rancher all a plus\nProficient in troubleshooting and code testing\nExperience in both front and back-end development\nSome Linux/Apache server administration experience preferred\nExperience with version control (preferably Git)\nStrong communication skills; professionalism\nQuick learner\nBlenderBottle Company is an equal opportunity employer.\n\nPhone calls regarding this position are not accepted.\n\n0\n\nJob Posted by ApplicantPro\n",
    "location": "Lehi, UT",
    "employer": "BlenderBottle"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=4120&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_e0d9e59b&cb=1560102001199&jobListingId=3258745632",
    "title": "Software Developer - Entry Level",
    "description": "Job Description\n\nWe are looking for talented graduates who are hungry to be challenged and grow their skill sets. While we have been in business since 2001, we are still a young company with great growth potential and opportunity as our market and client-base expands. We need customer service oriented software developers who are leaders, problem solvers, and high achievers that go above and beyond simple project requirements.\n\nOur software developers are asked to work on a myriad of projects with varying due dates and deadlines. These projects range in complexity and encompass internal tools, custom incentive programs for clients, new feature functionality for our core product or ancillary products, the re-architecture of our core product and other items.\n\nAs such, our developers work in all facets of the application architecture (full stack) and are eager to utilize whatever technology is necessary to get the job done efficiently and accurately. Additionally, our developers must have the ability to think on their feet and be cognizant of the bigger picture. Initiative and problem-solving skills are a must.\n\nDevelopers who thrive in our environment think beyond the project requirements and deliver projects with consideration for their team, the overall customer experience, and future of our product.\n\nWe need individuals who:\nCan code\nAre positive team players\nWilling to get their hands dirty within some older technologies\nWilling to get their hands dirty working with newer technologies\nAre great communicators\nHave an ability to learn an established, complex product quickly\nAre excited to solve problems and want to help a young company grow\nPreferred Experience: Nice to have:\nC# / VB.NET\nJavaScript / jQuery\nAngular\nSQL Server / T-SQL\nHTML / CSS\nGIT\nStrong Debugging Skills\nMicrosoft Visual Studio\nScrum / Agile\nAzure DevOps\nWeb API\nIdentity Server\nReact\nMVC\nWCF\nXamarin\nXML / XSLT\nWeb Forms\n\n",
    "location": "Nashville, TN",
    "employer": "360 View"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=4120&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_61894f52&cb=1560102001199&jobListingId=2617041217",
    "title": "Software Developer",
    "description": "\n\nJob Description:\nDesign, develop and test in-house proprietary solutions for Web Service and Data Exchange Services using Cold Fusion among other technologies such as NodeJS, React etc. Detailed job duties include: Create and maintain documentations necessary such as Technical Design Specifications, Test Cases and Test Results through the course of the project; Participate in team design sessions and code reviews; Execute test cases, and create a log of defects discovered during testing ; Participate in Sprint Planning, Daily Stand Up, and Retrospective; Understand and apply Object Oriented Analysis and Design principles and of N-tier application architecture, and software design patterns as necessary. Ensure application development deliverables are completed on time.\n\nMinimum job requirement:\nMaster’s degree in Computer Science, Computer Engineering or related field and at least three years of experience. Will accept Bachelor’s degree and five years of experience in lieu of Master’s degree and three years of experience. Must have experience in software development using the following: VB.Net, Oracle , Microsoft SQL Server, SOAP Web service , RESTful API, JavaScript , Node JS , React, JQuery, Bootstrap, CSS, HTML, JSON.",
    "location": "Sacramento, CA",
    "employer": "Netpace"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=389273&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_104adade&cb=1560102001200&jobListingId=3253241597",
    "title": "Software Developer",
    "description": "C2FO is looking for software engineers with a variety of experience including entry level.\n\nOur Software Engineers are at the forefront of how customers interact with C2FO. Working with our product team, we create applications for both internal and external customers. Our philosophy: short iterations with a focus on scalability while ensuring maintainability.\n\nDay in the life of a software engineer at C2FO\n\nDaily\nPlan for the week with your team on Monday during sprint planning meetings or weekly check-in meetings. We do two-week sprints.\nStay up-to-date with the company and interesting people in KC during the company all-hands meeting.\nGive and receive feedback on your teams code by reviewing pull requests on Github.\nOn any day pick up a task from the Jira sprint board, get in the zone and code.\nEnjoy catered lunch from that days local restaurant (Monday, Tuesday, and Wednesday).\nAfternoons can vary depending upon features; typically they are made up of coding.\nAfter work, hang out and play board games, enjoy camaraderie, shoot pool, or play some ping pong.\nPeriodically\nReview or create RFCs (request for comments) for technical debt or changes that may impact your team or other teams.\nDiscuss UI/UX designs for up-coming features with our designers.\nDiscuss technical designs with your team during a design document walkthrough.\nBreak down project details with our Product Managers.\nOur Tech Stack(Not a list of requirements)\nAngular, React.js, Ember.js, Sass\nRest and GraphQL APIs built in Node.js and Kotlin\nPostgreSQL (AWS RDS)\nScala\nKubernetes for our Cloud infrastructure\nAWS and GCP\nDocker\nStandard Benefits\nCompetitive salary commensurate with experience\nGenerous health benefits\n401K plan (with employer match)\nPerformance bonus\nTuition reimbursement\nOpportunity to earn equity in the company\nExtraordinary Benefits\nOur culture of trust allows employees to get their work done with an unlimited amount of PTO.\nWork from home if you have a sick child, dog, cat, or chameleon. Come in late if youre having a package delivered. We support flexible schedules so our employees can achieve their best possible work.\nCant work on an empty stomach; we have a stocked kitchen with snacks & drinks.\nGet a taste of Kansas City with catered lunch 3 days a week from a variety of local restaurants.\nTravel with your teammates to 2 conferences a year! AWS re: Invent, JSConf, React Conf, RustConf or your choice, we support our employee's desire to stay educated.\nEnjoy a fun atmosphere with our company outings to Sporting KC, Royals, Axe Throwing, Pickleball...etc\nAbout C2FO\n\nC2FO is the largest non-bank provider of working capital to businesses. Weve also been recognized by Forbes Fintech 50 and are on track to become the first financial unicorn company in the state of Kansas.\n\nOur technology provides hundreds of thousands of businesses of all sizes (suppliers) an easy, low-cost way to improve cash flow through early invoice payments, while at the same time helping Fortune 500 companies (buyers) achieve far better returns on short-term cash than any other investment vehicle available.\n\nWe also provide our network of businesses access to the lowest cost and most convenient capital sources through receivables finance, which includes asset-based lending and factoring.\n\nC2FO is headquartered in Kansas City, USA and backed by leading venture capital firms including Temasek, Tiger Global, Union Square Ventures & Mithril.\n\nJob Type: Full-time\n\nWork authorization:\nUnited States (Preferred)",
    "location": "Leawood, KS",
    "employer": "C2FO"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=182759&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_b3678774&cb=1560102001201&jobListingId=3260229492",
    "title": "Software Developer - Entry Level",
    "description": "SunIRef:it\n\nSoftware Developer - Entry Level\n\nWe are looking for talented graduates who are hungry to be challenged and grow their skill sets. While we have been in business since 2001, we are still a young company with great growth potential and opportunity as our market and client-base expands. We need customer service oriented software developers who are leaders, problem solvers, and high achievers that go above and beyond simple project requirements.\n\nOur software developers are asked to work on a myriad of projects with varying due dates and deadlines. These projects range in complexity and encompass internal tools, custom incentive programs for clients, new feature functionality for our core product or ancillary products, the re-architecture of our core product and other items.\n\nAs such, our developers work in all facets of the application architecture (full stack) and are eager to utilize whatever technology is necessary to get the job done efficiently and accurately. Additionally, our developers must have the ability to think on their feet and be cognizant of the bigger picture. Initiative and problem-solving skills are a must.\n\nDevelopers who thrive in our environment think beyond the project requirements and deliver projects with consideration for their team, the overall customer experience, and future of our product.\n\nWe need individuals who:\nCan code\nAre positive team players\nWilling to get their hands dirty within some older technologies\nWilling to get their hands dirty working with newer technologies\nAre great communicators\nHave an ability to learn an established, complex product quickly\nAre excited to solve problems and want to help a young company grow\n\nPreferred Experience:\n\nNice to have:\n\nC# / ******\nJavaScript / jQuery\nAngular\nSQL Server / T-SQL\nHTML / CSS\nGIT\nStrong Debugging Skills\nMicrosoft Visual Studio\nScrum / Agile\n\nAzure DevOps\nWeb API\nIdentity Server\nReact\nMVC\nWCF\nXamarin\nXML / XSLT\nWeb Forms\n\nIf you have the drive to make a product better and aren't afraid to test your limits, then email your resume and cover letter to ****************\n\n360 View - 3 hours ago - report job\n\nIf you require alternative methods of application or screening, you must approach the employer directly to request this as Indeed is not responsible for the employer's application process.",
    "location": "Nashville, TN",
    "employer": "360 View"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=150325&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_63a2b636&cb=1560102001205&jobListingId=3259245921",
    "title": "Software Developer - Analytics Platforms",
    "description": "Software Developer - Analytics Platforms\nWe deliver our customers peace of mind every day by helping them protect what they value most. Our passion for placing the customer at the center of everything we do is driving a transformational shift at Liberty Mutual. Operating as a tech startup within a Fortune 100 company, we are leading a digital disruption that will redefine how people experience insurance.\nAbout the job:\nWe are seeking an experienced, motivated Software Developer with Full Stack skills, to participate in software development within an Agile team supporting our Analytic Platforms and Services department. You will be working on our existing analytics application, Cortex. This is an internally developed Java application that is intended to allow analytics teams to quickly create, manage and terminate their own scalable high-performance cloud computing and storage environments to support analytics, machine learning and big data projects.\nCortex includes a provisioning service that works with both AWS and Azure, a tools portal that allows users to work with popular data science tools like R and Python, a fully compliant security layer, and several utilities that make it easy to stage data science problems with Cortex. The Cortex team also works directly with Liberty data science teams in all markets to assist them with their projects and gather new requirements and insights to support the ongoing development of the platform.\nThe industry changes quickly, so we are looking for candidates who can respond to change, pick up new technologies quickly and adapt to changing requirements. We also want candidates who take pride in their work and have strong design and development expertise. We value quality code delivery and expect candidates to demonstrate competence at writing, testing and debugging Java code.\nDesired skills:\nGenerally 2+ years of professional development experience in Java.\nExperience with Full Stack Development including HTML, JavaScript, React and Angular\nKnowledge in web service development, design and specifications writing with SOAP or REST.\nFoundational knowledge or proficient in new and emerging technologies such as AWS, Azure and Cloud, DevOps, CI/CD and MicroServices.\nExcellent analytical, problem solving, and communication and collaboration skills.\nGeneral knowledge of agile software development concepts and processes.\nMust be proactive, demonstrate initiative and be a logical thinker.\nExperience with layered system architectures and layered solutions; understanding of shared software concepts.\nHighly competitive candidates will have:\n\n\nPython\nSpark\nR Language\nQualifications:\n\n\nBachelor's Degree in technical discipline preferably computer science or software development.\nGenerally 2+ years of professional development experience\nKnowledge of IT concepts, strategies, methodologies, architectures and technical standards\nAnalytical, problem solving, and communication skills\nExperience with layered system architectures and layered solutions; understanding of shared software concepts\nExtensive knowledge of IT concepts, strategies and methodologies.\nExtensive knowledge of a business function(s) and of business operations. Extensive knowledge of design and development tools.\nExtensive knowledge of architectures and technical standards.\nExtensive knowledge of layered systems architectures and layered solutions and designs; extensive understanding of shared software concepts.\nProficient in multiple programming languages and tools.\nProficient in new and emerging technologies.\nNegotiation, facilitation and consensus building skills.\nStrong oral and written communication skills; presentation skills.\nWe take care of our employees...\n\n\nWe strongly believe that a great job should keep you happy both at work-and in life. That's why we offer:\nWorkplace Flexibility\nWellness Perks\nCollaborative workspaces\nSit/stand desks\nCareer development, programs and classes\nDiversity & Inclusion programs\nCommuter Benefits\nAdoption Assistance\nCollege Savings Plan\nEducation reimbursement\nHackathon Events\nLiberty Mutual was named as a '2016 Great Place to Work' by Great Place to Work US.\nFor more info about our benefits - Benefits Information\nLearn more about Tech at Liberty Mutual - Search Our Jobs\nCheck out our Tech at Liberty Mutual YouTube playlist - Show me the Videos",
    "location": "Portsmouth, NH",
    "employer": "Liberty Mutual Insurance"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=4120&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_1c92450c&cb=1560102001206&jobListingId=3255464436",
    "title": "Junior Software Developer – Interim",
    "description": "Are you passionate about front-end development and would you like to work with technologies like Angular5 and Typescript?And are you naturally curious about different technologies and possess a can-do-attitude when it comes to building new and innovative solutions? If so, we offer you a unique opportunity in the LEGO Group!Core Responsibilities• Working with user-centric development, the developer will be part of a team that has the responsibility of delivering functionality for our customers in the Mechanical Engineering areas.\nFront end development with HTML 5, CSS, JavaScript, Angular etc.\nInterfaces towards backend systems like Siemens Teamcenter and SAP together with the team, our project owner and our architects. Requires knowledge and interest in programming languages in general. Primary Java but it is an advantage to be open for other languages like C# and database in general.\nProvide support in the form of advice and analysis of user/operational issues, and use the analysis to formulate a resolution.Play your part in our team succeedingThe department is responsible for IT in relation to LEGO Industrial Engineering areas, who makes equipment for producing LEGO bricks and LEGO boxes.\nThis includes software development, maintainance/support of our system/applications and consultancy towards our business areas.Do you have what it takes?• Newly graduated Software Developer from Computer Science, IT Engineering or a similar education within IT.\nNone or less than 1-2 year of experience\nGood communication skills in general and English on high level\nNaturally curious about different technologies and have a strong willingness to learn\nA can-do-attitude and are not afraid to take on new tasks or try out new solutions\nExperience and interest with Front-End development including HTML 5, CSS, JavaScript\nExperience with Java and/or .NET\nA self-driven personality while still being a good team player\nExperience with Angular, React or similar\nKnowledge about Cloud solutions like AWS, Azure etc.\nExperience with RESTful services\nHave knowledge about databasesJoin the global LEGO® familyThe LEGO Group recruits and develops people entirely on merit. If you are confident you have what it takes to succeed in this role – and you share our commitment to creativity, collaboration, and quality – use the APPLY NOW button above or below. Please remember to attach your application and current CV.\nBRINGING IT TO LIFE\n“Join our fantastic team at LEGO where you can develop your skills and work in an inspiring and international environment,” says IT Director\n\nLI-UB1",
    "location": "United States",
    "employer": "Lego Group"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=4120&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_08d76951&cb=1560102001210&jobListingId=2769713006",
    "title": "Software Developer",
    "description": "Software Developer\n\n1 Position\n\nDo you have a passion for developing enterprise-level, cloud-oriented architecture and software applications?\n\nEmail to Apply\nCareers@palador.com\n\n\n+\n\n\nWhat We Need\n\nDo you spend time tinkering with code to come up with a final product you can take pride in? Do you collaborate effectively in a small team setting?\n\nIf you do, we want to talk to you! We currently have an opening for a full-stack software developer position, perfect for a self-motivated developer who takes initiative to find creative and scalable solutions.\n\n\nWho We're Looking For\nRequired Skills\nC#\nSQL Server\nASP.NET MVC\n.NET Framework\n.NET Core\nHTML\nJavaScript\nJQuery\nXML\nAngular/React\nEnglish proficiency\n\nRequired Experience\nBachelors degree in computer science or similar\n\n",
    "location": "Seattle, WA",
    "employer": "Palador"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=182759&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_de179477&cb=1560102001212&jobListingId=3258523286",
    "title": "Software Developer",
    "description": "Software Developer\nNorth America-North America-United States-CA-Brea\nThe Full Stack Developer will participate in design, development, and\nmaintenance of the Beckman Coulter s multiple application services.\nThe scope of the role includes the following:\nParticipate in the software development lifecycle of Beckman\nCoulter web and mobile applications including\nRequirements gathering\nSoftware Design\nPrototyping\nDevelopment\nTesting\nMaintenance\nSupport\nCollaboratively work within technical and business teams to\nidentify solutions and generate associated software designs\nEffectively communicate status, solutions, and issues to both\ntechnical and non-technical audiences\nWork effectively within globally distributed teams\nAdditional Position Profile:\nRequires knowledge and experience in own discipline; still\nacquiring higher-level knowledge and skills\nBuilds knowledge of the company, processes and customers\nSolves a range of straightforward problems\nAnalyzes possible solutions using standard procedures; technical\nexperience and judgement and precedents\nReceives a moderate level of guidance and direction\nRequires expanded conceptual knowledge in own discipline and\nbroadens capabilities\nUnderstands key business drivers; uses this understanding to\naccomplish own work\nNo supervisory responsibilities but provides informal guidance to\nnew team members\nImpacts quality of own work and the work of others on the team;\nworks within guidelines and policies\nExplains complex information to others in straightforward\nsituations\n#LI-SL1.\nBachelor s degree in Computer Science with 2+ years experience or\nMaster s degree in Computer Science with 0-2 years experience\nExperience on architecting and supporting applications\nExperience working as a software developer\nExcellent communication and the ability to translate stated and\nunstated stakeholder needs into solutions\nAbility to:\nevaluate and analyze existing software architectures\nlead the architecture and design reviews.\ndefine and document software interfaces.\nproduce code for prototypes, and production systems.\nlearn about, maintain and evolve existing systems and\narchitectures. Redesign existing architectures to accommodate\nmigration to new technologies and platforms.\npresent complex technical information to diverse audiences.\nTeam player, ability to work effectively in a matrix organization,\nwith geographically dispersed team members\nSelf-starter, ability to envision solutions and take initiative to\nsee the solution to the end despite challenges\nAbility to think strategically under the given constraints.\nRequired Core Skills:\nFull stack development, front end, back end, database, third party\nintegrations, etc.\nStrong React/Redux experience\nStrong Node.js/Javascript experience\nAWS Cloud services with emphasis on serverless architecture\n(lambda, docker, Kubernetes)\nHTML/CSS/Javascript/AJAX\nREST and Microservice Architecture\nSQL and Common DBs (Oracle, MySQL, Postgres)\nRequired Software Engineering experience:\nArchitecture and detailed design\nSCM Tools (Git, SVN)/Branching Strategies\nGood documentation of code and design\nPerformance testing and tuning\nContinuous Integration and Deployment Tools (Jenkins + Groovy)\nAgile experience\nOther optional but desired skills:\nJava\nSitecore\nElasticsearch\nJIRA and Confluence\nMicrosoft Teams\nSingle Sign On (SSO) with OpenID connect\nDiversity & InclusionAt Danaher, we are dedicated to building and\nsustaining a truly diverse and inclusive culture. These are not just\nwords on a page Diversity and Inclusion is a top priority for the\ncompany, and it ties deeply to each of our core values. Danaher\nCorporation and all Danaher Companies are equal opportunity employers\nthat evaluate applicants without regard to race, color, national\norigin, religion, sex, age, marital status, disability, veteran\nstatus, sexual orientation, gender identity, or other characteristics\nprotected by law.\nInformation Technology\nFull-time",
    "location": "Brea, CA",
    "employer": "Leica Biosystems"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=393813&s=58&guid=0000016b3d535898b97c791e58401e4b&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_0dbd561c&cb=1560102001213&jobListingId=3255484867",
    "title": "Software Developer",
    "description": "At Pearson, we’re committed to a world that’s always learning and to our talented team who makes it all possible. From bringing lectures vividly to life to turning textbooks into laptop lessons, we are always re-examining the way people learn best, whether it’s one child in our own backyard or an education community across the globe. We are bold thinkers and standout innovators who motivate each other to explore new frontiers in an environment that supports and inspires us to always be better. By pushing the boundaries of technology — and each other to surpass these boundaries — we create seeds of learning that become the catalyst for the world’s innovations, personal and global, large and small.\n\nWe’re looking for the next generation of talented Software Developers to join our team. This is a unique opportunity for a newly qualified Software Engineering graduate, or an individual early in their career to work in a fast-paced exciting development team building applications that support the creation of content for our digital and mobile learning products.\n\nRole Outline\n\nThe job is to work within the development team to deliver ground breaking technology services for both internal and external customers. The right person will further develop the skills required for a full-stack java and web developer and will gain knowledgeable in enterprise architecture principles, the integration of multiple APIs and systems, and how to support customers and integration partners in multiple timezones. Development will be in Node JS (server) and React JS(View). Through your work in our team you will build practical expertise in the following accountabilities:\nFinding simple, elegant, powerful and pragmatic solutions to complex problems\nWork according to devops principles, with full test automation and continuous integration and delivery, and using immutable infrastructure with Docker on AWS.\nExperience with an object oriented programming language.\nJavascript skills - Node.js or React experience is great\nDay to Day Functions:\n\nUnder the direction of Platform Director and Technical Lead you will:\nWork with offshore and onshore development teams to understand, develop and continuously improve platform designs\nTake responsibility for the quality of your code / integration work delivered\nEnsure the highest development standards are followed\nCoordinate with testing team to support test activities\nActively challenge and refine design and delivery based on experience and domain knowledge; additionally seek peers reviews with external (non-project related) resources to validate approach\nKey Challenges:\nWorking with a number of stakeholders and business units within Pearson, and across multiple timezones and cultures\nFast paced environment, looking to deliver truly transformative technology against challenging timescales\n\nSkills & Qualifications\nBS in Computer Science, Computer Systems Engineering, or related disciplines.\nHands on engineering experience in either modern Javascript frameworks (React.js, Angular, Ember, etc.) or client-side languages (Java, Node, etc.)\nFamiliarity with Single-page web application development, using JavaScript frameworks, HTML5 and CSS.\nInterest in developer productivity\nStrong problem-solving and analytical skills\nStrong communication skills\nAbility to work both independently and in groups, including widely distributed team members in a global enterprise\nAbility to prioritize and set goals on shifting priorities\n#LI-LL",
    "location": "United States",
    "employer": "Pearson"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=202&ao=389273&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_af6e1a38&cb=1560102074819&jobListingId=3253300819",
    "title": "Software Developer",
    "description": "Entech delivers next-generation lending solutions that drive loan conversions, and we provide custom software solutions designed for todays digital, mobile-first generation. If you have the skill, energy, and enthusiasm, and you enjoy working in a fast-paced aggressively growing company, we have a job for you!\n\nEntech is looking to expand our Product Development team. We are looking to add a Software Developer. We need solution minded developers who can help us take our platform to the next level.\n\nOur tech stack is constantly evolving:\n\nCurrent Stack: C#, MVC and Entity Framework\n\nNew Stack: Moving to .Net Core, Docker, and REACT in the near future!\n\nResponsibilities:\nBuild new features while improving the high availability, scalability, and efficiency of our Loan Origination Software.\nEvaluate existing applications to reprogram, update and add new features.\nUnderstand client requirements and how they translate in application features.\nCollaborate with a team to set specifications for new applications.\nWrite high-quality source code to program complete applications within deadlines.\nIdentify performance issues, failure points and develop new technology to enable future scalability.\nPerform unit and integration testing before launch.\nQualifications:\nSolid hands-on experience developing web-based applications using all or almost all of the following technologies: object-oriented analysis and design, .NET (C#, Entity Framework, ASP.NET MVC), SQL Server, XML, HTML, Javascript, CSS, and MVC design pattern.\nUnderstand the software development life cycle.\nMust work well in a team environment.\nStrong verbal and written communications skills.\nComputer science/engineering degree preferred.\nLeadership & Culture:\nLead by example with personal discipline and continuous improvement.\nLove to learn and tinker constantly\nComfortable sharing failures, as well as successes.\nCreative thinker, confident and able to express complex ideas in an articulate, concise manner.\nJob Type: Full-time\n\nExperience:\nsoftware development: 1 year (Preferred)\nWork authorization:\nUnited States (Required)\nAdditional Compensation:\nBonuses\nWork Location:\nOne location\nBenefits offered:\nPaid time off\nHealth insurance\nDental insurance\nRetirement benefits or accounts\nFlexible schedules\nWorkplace perks such as food/coffee and flexible work schedules",
    "location": "Malvern, PA",
    "employer": "Entech"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=205&ao=6101&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_78bac9ff&cb=1560102074824&jobListingId=3150870004",
    "title": "Junior Software Developer",
    "description": "Why work at BaseCamp Franchising?\n\nBaseCamp Franchising is the franchisor of both Kid to Kid and Uptown Cheapskate. We are a growing, recession-resistant company with a history of success. Were small enough that your insights and innovations will have a big effect on the way we do things, but were big enough to use industry leading tools and services. We offer competitive pay with benefits that include 401K matching, paid maternity/paternity leave, stocked kitchen with soda and snacks, store discounts, Paid Time Off, flex days, and more.\n\nJob Requirements & Qualifications:\n\n• Bachelors in Computer Science or similar degree OR at least 2 - 3 years of on the job experience\n\n• The ability to work as a team player and independently\n\n• Excellent communication skills both verbal and written\n\n• The ability to verbalize and contribute to overall scope and strategy of the project\n\n• Own a project from start to finish with appropriate problem solving skills\n\n• Familiar with agile/scrum methodology, its our process\n\nTechnical Requirements:\n\n• 2 years professional software development experience or computer science degree with experience in Java 1.8\n\n• Strong understanding of object oriented and scripting languages\n\n• Strong skills in SQL, data modeling, and data manipulation\n\n• Knowledge and hands on experience in Java frameworks available such as Spring MVC, Vaadin, Grails, Hibernate\n\n• Understanding of various architectural paradigms\n\n• Proficiency with JavaScript and JavaScript design patterns\n\n• Good understanding of front-end technologies such as AngularJS, React, Backbone, Aurelia as well as proficiency in HTML5 and CSS3\n\n• Proficient understanding of code versioning tools such as Git or SVN\n\n• Knowledge and experience with PHP and/or Joomla will be given preference",
    "location": "North Salt Lake, UT",
    "employer": "Uptown Cheapskate Corporate"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=206&ao=248407&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_0967cf25&cb=1560102074825&jobListingId=3256584176",
    "title": "Software Developer",
    "description": "The Full Stack Developer will participate in design, development, and maintenance of the Beckman Coulter’s multiple application services. The scope of the role includes the following:\nParticipate in the software development lifecycle of Beckman Coulter web and mobile applications including\nRequirements gathering\nSoftware Design\nPrototyping\nDevelopment\nTesting\nMaintenance\nSupport\nCollaboratively work within technical and business teams to identify solutions and generate associated software designs\nEffectively communicate status, solutions, and issues to both technical and non-technical audiences\nWork effectively within globally distributed teams\n\n\nAdditional Position Profile:\nRequires knowledge and experience in own discipline; still acquiring higher-level knowledge and skills\nBuilds knowledge of the company, processes and customers\nSolves a range of straightforward problems\nAnalyzes possible solutions using standard procedures; technical experience and judgement and precedents\nReceives a moderate level of guidance and direction\nRequires expanded conceptual knowledge in own discipline and broadens capabilities\nUnderstands key business drivers; uses this understanding to accomplish own work\nNo supervisory responsibilities but provides informal guidance to new team members\nImpacts quality of own work and the work of others on the team; works within guidelines and policies\nExplains complex information to others in straightforward situations\n\n\n#LI-SL1.\n\n\nBachelor’s degree in Computer Science with 2 years’ experience or Master’s degree in Computer Science with 0-2 years’ experience\nExperience on architecting and supporting applications\nExperience working as a software developer\nExcellent communication and the ability to translate stated and unstated stakeholder needs into solutions\n\n\nAbility to:\nevaluate and analyze existing software architectures\nlead the architecture and design reviews.\ndefine and document software interfaces.\nproduce code for prototypes, and production systems.\nlearn about, maintain and evolve existing systems and architectures. Redesign existing architectures to accommodate migration to new technologies and platforms.\npresent complex technical information to diverse audiences.\nTeam player, ability to work effectively in a matrix organization, with geographically dispersed team members\nSelf-starter, ability to envision solutions and take initiative to see the solution to the end despite challenges\nAbility to think strategically under the given constraints.\n\n\nRequired Core Skills:\nFull stack development, front end, back end, database, third party integrations, etc.\nStrong React/Redux experience\nStrong Node.js/Javascript experience\nAWS Cloud services with emphasis on serverless architecture (lambda, docker, Kubernetes)\nHTML/CSS/Javascript/AJAX\nREST and Microservice Architecture\nSQL and Common DBs (Oracle, MySQL, Postgres)\n\n\nRequired Software Engineering experience:\nArchitecture and detailed design\nSCM Tools (Git, SVN)/Branching Strategies\nGood documentation of code and design\nPerformance testing and tuning\nContinuous Integration and Deployment Tools (Jenkins Groovy)\nAgile experience\nOther optional but desired skills:\n\n\nJava\nSitecore\nElasticsearch\nJIRA and Confluence\nMicrosoft Teams\nSingle Sign On (SSO) with OpenID connect\n\n\nDiversity & Inclusion\n\n\nAt Danaher, we are dedicated to building and sustaining a truly diverse and inclusive culture. These are not just words on a page—Diversity and Inclusion is a top priority for the company, and it ties deeply to each of our core values. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
    "location": "Brea, CA",
    "employer": "Danaher"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=207&ao=60939&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_2dafe812&cb=1560102074826&jobListingId=3188790327",
    "title": "Software Developer",
    "description": "Summary:\n\nOur developers are full stack solution creators, ready to build out applications using every tool at their disposal, from JavaScript to REST APIs written in C# or Node.js to database modeling.\n\nResponsibilities:\n\n· Participate in agile team activities\n\n· Work with product manager and technical team to plan solutions\n\n· Design, implement and test new features or enhance existing features\n\n· Maintain the standards and technical direction of the application\n\n· Provide a sufficient level of automated testing across the application\n\n· Diagnose and solve production issues\n\n· Stay current with web and mobile technologies and standards\n\nEducation:\n\n· BA/BS Degree in Computer Science or related field is preferred.\n\n· A minimum of 3 years experience in designing and implementing web and mobile applications.\n\nQualifications/Experience:\n\n· Software development experience is desirable, but entry level candidates are also encouraged to apply\n\n· Experience with object oriented design principles and SOLID development practices\n\n· Experience with and willingness to learn some of the following technologies:\n\no Server-side technologies:\nNET/C# - MVC\nNode.js\nRuby\no JavaScript and front-end frameworks\nReact\nAngular\no Relational and NoSQL databases\nMicrosoft Sql Server\nCosmosDb\nAzure Search\no Mobile development\niOS\nAndroid\nhybrid\no Cloud provider experience\n\n· Proven capability to create maintainable, adaptable software that is non-brittle and capable of change\n\n· Excellent team communication skills\n\nA commitment to Equal Opportunity Employer/Affirmative Action Employer\n\nDifferent perspectives result in even better solutions for our Member Campuses. At Campus Labs, we value diversity and do not discriminate on the basis of race, color, ancestry, national origin, gender, sexual orientation, marital status, religion, age, disability, gender identity, results of genetic testing/genetic information, pregnancy, childbirth, service in the military, veteran status, or any other status protected by federal, state, or local laws.",
    "location": "Buffalo, NY",
    "employer": "Campus Labs"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=209&ao=14295&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_a092dae4&cb=1560102074829&jobListingId=3189865402",
    "title": "Software Developer",
    "description": "True|IT’s Software Development team works with customers across many different industries. Our customers rely on us to be their partner in building their business. We are looking for people to join us in building partnerships with our customers so we can all succeed.\n\nEssential Responsibilities\nCreate new applications and new features to existing applications from requirements.\nAssist support team with escalated issues in a timely manner.\nInvestigate software defects and identify fixes.\nCreate integrations with third-party systems.\nCommunicate progress to project management on a timely basis.\nDelivery of projects on time and on budget.\nAssist in accurately estimating development efforts for new projects when requested.\nFlexibility, working with many customers can lead a dynamic work environment.\n(If experience mandates) Provide mentoring to junior members of the team.\nRequirements\nCompetencies Required\n.Net Framework,\nC#\nWeb API\nASP.Net (MVC, WebForms)\nJavaScript\nSOLID Development Principles\nSQL querying and performance tuning\nDesired Experience\n.Net Core\nSource code management systems\nCloud IaaS platforms, ideally Azure\nExperience with third party platforms\nMicrosoft Dynamics D365\nNopCommerce\nMicrosoft Business Central\nFamiliarity with JavaScript frameworks such as\nAngular\nReact\nKnockout\nVue.js\n2 years of C# .Net experience desired but not required",
    "location": "Osseo, MN",
    "employer": "TrueIT"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=210&ao=389273&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_70d23571&cb=1560102074831&jobListingId=3259512919",
    "title": "Full Stack Software Developer",
    "description": "As a Full Stack Developer, you will be part of a growing team, building our next generation internet platform. We enable artists to manage license, distribute, and market their music and buyers to discover and license music. In this role, you are constantly looking for inventive ways to build the most effective tools and user experience for our customers.\n\nAbout the Job\n\n· Build globally available software solutions using C#.NET, Mongo DB, SQL, React, and JavaScript\n\n· Collaborate with product managers, UI/UX designers, QA, and DevOps administrators\n\n· Develop applications for scalable internet systems leveraging cloud providers like AWS\n\n· Develop REST APIs, Business Objects, databases, and integrations with external systems\n\n* * Local Candidates Only (Los Angeles Area) * *\n\nQualifications\n\n· Solid understanding of object-oriented programming, API design, and databases\n\n· Work Experience programming applications using C#, ASP.NET MVC, React, and Javascript\n\n· Work Experience using AWS or other cloud service providers\n\n· Work Experience building public facing REST APIs\n\n· Work Experience utilizing NoSQL Databases such as Mongo\n\n· Experience working in a DevOps environment (Git, CI/CD Pipelines, Jira, Docker, AWS)\n\n· 3+ years of employment building scalable internet applications as a software developer\n\n· 3+ years of employment using SQL or NoSQL database technology\n\n· Bachelors degree in computer science or related technical field\n\n· Experience using Agile/Scrum development methodology is a plus\n\nSongtradr is an equal opportunity employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, disability, veterans status, sexual orientation, or any other protected factor.\n\nJob Type: Full-time\n\nExperience:\nDatabase: 3 years (Required)\nWeb Development: 3 years (Required)\nAPI: 3 years (Required)\nEducation:\nBachelor's (Preferred)\nLocation:\nSanta Monica, CA (Preferred)\nWork authorization:\nUnited States (Required)\nWork Location:\nOne location\nBenefits offered:\nPaid time off\nHealth insurance\nWorkplace perks such as food/coffee and flexible work schedules",
    "location": "Santa Monica, CA",
    "employer": "Songtradr, Inc."
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=211&ao=454823&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_cf5d8f66&cb=1560102074832&jobListingId=3256704701",
    "title": "Software Developer",
    "description": "Adler University is recruiting a full time Software Developer. The Software Developer will design, build, test, and document business applications and services, in addition to assisting with deployment and maintenance tasks of the application environment both on premise and in the cloud. This position will work closely with technology and other department staff to define and develop software requirements supporting the business processes of Adler University. The Software Developer will design, build, test, and document business applications and services, in addition to assisting with deployment and maintenance tasks of the application environment both on premise and in the cloud. This position will work closely with technology and other department staff to define and develop software requirements supporting the business processes of Adler University. This includes the support of current systems as well as the development of new software. This position will serve as a development lead andor project lead. Idealpreferred candidate experienced with AWS or Azure cloud technology. Full stack programmer capable of picking up unfamiliar technologies quickly and working effectively in an agile environment as well as creative at architecting, designing and building solutions to complex problems. Key Responsibilities Design and implement solutions with Microsoft Azure API Mgmt. Gateway, Service Fabric, Kubernetes and other open source frameworks Design and implement services based on different standards for REST, Data integration techniques, Eventing, Messaging, and Transformation engines and downstream platforms. Assist with the facilitation of end-user documentation, design and testing of business solutions. Lead the team of developers and apply previous experience in designing and implementing API specifications, standards, consistency and secure development practices for API lifecycle development. Provide post-implementation support and maintenance by leveraging industry best practices and methods. Be a hands-on lead engineer, own production needs, and manage project execution. Collaborate with the rest of the development team to design and launch new features. Mentor developers to build the right solution at the right time and make the right design decisions and technology choices. Maintain working knowledge of API security standards and implementation (Oauth 2.0, OpenID, JSON, Web Token) Maintain knowledge of API security, authentication, authorization, IP security setup, and endpoint configuration. Advocates for the team's technical quality by insisting on design and code reviews, performance tests, test automation, and unit test strategies. React to and lead shifting priorities without compromising deadlines and team momentum. Contribute in technical capacity across different work streams. Qualifications Specialized Skills A Bachelor s degree in Computer Science or Information Systems or an equivalent combination of related education and work experience. Three or more years of software development experience. Experienced with back-end programming languages PHP, Python, .NET, and Git, Atlassian stack. Design overall architecture of the web application and Sharepoint. Focus on automation and continuous delivery (TDD). Understanding and implementation of security and data protection.Build production-quality enterprise grade systems that achieve target SLAs for scalability, reliability, and performance on schedule. Highly experienced in the design, implement and maintenance RESTful APIs and Micro-services development. Strong customer service focus, interpersonal and collaboration skills. Effectively communicate status and development challenges work independently, organized and detailed oriented. Provide 3rd tier support for production systems. Familiar with automated unit, integration, and performance testing frameworks. Preferred Skills Masters Degree Agile Methodologies Ultimate Software Colleague by Ellucian Adler University offers equal employment opportunities to all persons without regard to race, color, ethnicity, religion, sex, sexual orientation, gender identity, national origin, age, marital status, physical or mental disability, parental status, housing status, genetic information, arrest record, source of income, or military status, in accordance with applicable federal, provincial, state, and law equal employment opportunity laws.",
    "location": "Chicago, IL",
    "employer": "Adler University"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=214&ao=14295&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_cf44e689&cb=1560102074849&jobListingId=3223988747",
    "title": "Software Developer",
    "description": "The Riveter is looking for an experienced software developer to collaborate with our technology team in creating a world class digital experience for our members. We are open to candidates anywhere in the USA. Our HQ is based in Seattle and we run our product team with members outside of the state.\n\nWhat You’ll Do:\nCollaborate with the product team to evaluate a product experience holistically, identify next steps, and deliver the individual features that make up the product\nObjectively explain and represent your contributions and deliverables to your team\nClearly communicate with your project team to make sure they have full context of your work and that you have the same of theirs, jumping in on other tasks as needed to bring the most value to the system\nTake on various tasks, development-related or not, to support different processes and needs on your project teams\nYou’re Our Ideal Teammate if You Have:\n3+ years of full-stack experience in product development, from ideation to launch\nProven skills in React and/or React Native and JavaScript more generally\nFront end experience with CSS and preprocessors\nProficiency with the PHP language and the Laravel Framework, or similar\nFirm grasp on server operations, Linux system administration, and database design and optimization\nFamiliarity with building both functional and engaging web experiences\nPassion for principles & methods of Human Centered Design\nExperience with working in an iterative, adaptive, agile/lean way\nSolid time management skills and an inspiring attitude\nA commitment to improve software development practices for yourself and your team\nFamiliarity solving problems across multiple technology platforms (eg. browsers, applications, operating systems, mobile and connected devices, other hardware)\n(Preferred) Demonstrated practice w/test-driven/behavior-driven product development",
    "location": "Seattle, WA",
    "employer": "The Riveter"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=217&ao=359521&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_497ca553&cb=1560102074853&jobListingId=3259978967",
    "title": "Software Developer",
    "description": "* This is not a remote position **** No sponsorship offered for this position ** No relocation benefits for this position **At ASM we build best-in-class products for health care administration and quality assurance. We use the latest technology to provide products to over 1,200 health care organizations worldwide. Founded in 1982 we have developed a great team to build great products.What would I do at ASM?With thousands of hospitals across the world, you would help develop new features, re-design UIs, and help maintain existing services and products offered by ASM. You will need to rely on an understanding of ASP.NET, Javascript, and SQL to craft changes that have an impact.Who is the ideal candidate? You understand the importance of user experience, quality, and reliability. You empathize with the struggles of end-users and advocate on their behalf. You get excited solving design and performance challenges with other developers, building reusable components, and then continuing to improve those services and components.Responsibilities Improve and maintain our React and ASP.NET Components Connect our front-end components to the API and databases Design and maintain components for our web and mobile products Conceptualize original ideas that bring simplicity and user friendliness to complex ideas Required Experience Proficiency in HTML, CSS, and Javascript. Familiarity with C# (or similar) Familiarity with MS SQL (or similar) To care deeply about reliability and performance A strong attention to detail Bonus Experience Familiarity with React JS Familiarity with iOS and/or Android Familiarity with GitHub and version control. Familiarity with ASP.NET Familiarity with Angular JS Healthcare Experience Why choose ASM?We offer everything you'd expect from a successful and established software company.Every developer and designer has an SSD-enabled laptop, dual 24\" LED monitors, Sit/Stand Desks, Herman-Miller chairs.Modern Technology - We stay up-to-date with the latest in our diverse technology stack.Catered lunches on FridayAnnual company Vegas trip",
    "location": "Temecula, CA",
    "employer": "Applied Statistics & Management Inc."
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=220&ao=85058&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_0f2dc185&cb=1560102074856&jobListingId=3256532424",
    "title": "Software Developer",
    "description": "Job Description\nWe are seeking a Full Stack Developer to become an integral part of our team! You will develop and code for various projects in order to advance software solutions.\n\nResponsibilities:\nDevelop and expand features and products using a variety of programming languages\nReview project requirements and write technical specifications\nDebug, test, and fix errors\nDocument code development and revisions\nCreate and use software tools to help automate writing code\nTeam build projects\n​Qualifications:\n2+ years in Software Development, or other related fields\nJS, and a JS framework (Vue, React, Angular)\nPHP 7.x\nIIS\nApache\nKnowledge of C# a plus\nWorking knowledge of Laravel a plus\nFamiliarity MySQL and SQL Server\n​Strong problem solving and critical thinking skills\nStrong attention to detail\n\nCompany Description\nUF Resources Corp, with headquarters in Sarasota/Bradenton, Florida, is a leading provider of estate & financial planning services with a focus on helping people with all the resources they require to meet their estate and financial planning needs, with access to an experienced estate planning attorney. With our services and plan, members have the confidence of knowing that they have one place, one team of trusted professionals who will assist with needs and goal and ready to facilitate various legal, financial and tax strategies.\n\nGREAT HOURS 8:00am-4:30pm Monday through Friday\n\nPAID WEEKLY\n\nEXCELLENT BENEFITS AFTER 90 DAYS to include Major Medical, Dental, Vision, 401k and Life Insurance.\n\nwww.legacyassuranceplan.com",
    "location": "Sarasota, FL",
    "employer": "UF Resources"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=221&ao=85058&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_9a1e4f8a&cb=1560102074858&jobListingId=3257946958",
    "title": "Software Developer",
    "description": "Job Description\nAnchor Tech is seeking multiple Software Developers with at least 3 of development experience to join a Health IT company in the Columbia area, asap!!!\n\nPosition Title: Point Solutions Developer\n\nReports Directly To: Director of Innovation\n\nLocation: Columbia, MD\n\nHours Per Week: 40\n\nDescription:\n\nExciting opportunity to develop cutting edge software in ASP.Net Core, ASP.Net MVC 5 and Azure in a team-based agile environment. Help improve healthcare in Maryland and beyond.\n\nSecurity Level High -Understanding of HIPAA privacy requirements and adhere to those requirements. Understand secure handling of PHI and accept responsibility for managing it securely. Demonstrate leadership in managing access to PHI\n\nESSENTIAL DUTIES AND RESPONSIBILITIES\n\nInclude the following. Other duties may be assigned.\nDetailed design, coding, code optimization, unit testing, and code deployment.\nFull software lifecycle: requirements gathering, analysis, solution design, development, code reviews, test automation, and implementation using Agile methodologies (Scrum, TDD, BDD).\nReview and provide feedback on other developers’ code.\nHelp your team solve difficult problems, learn from and mentor other developers.\nCommunicate effectively with team members, project managers and customers.\nReview designs of your peers, as well as fix bugs, and troubleshoot operational issues.\nAccountable, solution-oriented team that meets goals, focused on satisfying customer needs.\nExpand your knowledge of HIT software by serving healthcare organizations.\nCreative problem-solving working in a team.\nQUALIFICATIONS\n\nTo perform this job successfully, the incumbent must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nDesire, persistence and skills to learn new technologies.\nTeam player and communicator.\nThrives in a fast-paced environment & welcomes change.\nTakes pride in delivering software that meets the client’s needs.\nKnowledge or experience with Agile incremental development methods.\n3+ years of software development experience.\n3+ years of experience with an Object-Oriented Programming Language (e.g. C#, Java).\n2+ years of experience with web development using an MVC Framework (e.g. ASP.NET MVC, Angular, React, Vue)\n2+ years of experience in developing APIs or middle tier software.\n2+ years of experience using version control (e.g. Git, TFS, Subversion).\nA preferred candidate will also have experience with:\nHL7 specifications, specifically FHIR R4\nContinuous Deployment/Continuous Integration (e.g. using Azure Pipelines)\nSQL/SQL Server\nIf you're interest and qualified, please apply and/or contact Anthony @ (443) 749-5348",
    "location": "Columbia, MD",
    "employer": "Anchor Staffing"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=222&ao=66506&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_93287e3a&cb=1560102074859&jobListingId=3258349775",
    "title": "Software Developer",
    "description": "Company Description\n\nEHFNET is a part of WiLine Networks, a global leading provider of fast, flexible, affordable communications services solutions to businesses, building owners, wholesale providers. We offer configurable solutions that empower our customers to select the right combination of bandwidth and services to maximize productivity. Through a single broadband connection over our private network, we deliver voice, data, video and mobility solutions.\n\nJob Description\n\nWe are looking for a Java developer responsible for building Java applications. This includes anything between complex groups of back-end services and their client-end (desktop and mobile) counterparts. Your primary responsibility will be to design and develop these applications and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality are essential.\nWe are also looking for a great Go developer who possesses a strong understanding of how best to leverage and exploit the languages unique paradigms, idioms, and syntax.\n\nResponsibilities\n\nTranslate application storyboards and use cases into functional applications\n\nDesign, build and maintain efficient, reusable, and reliable Java code\n\nEnsure the best possible performance, quality, and responsiveness of the applications\n\nIdentify bottlenecks and bugs, and devise solutions to these problems\n\nHelp maintain code quality, organization, and automatization\n\nSkills\n\nA minimum of 2 years relevant development using Java\n\nStrong knowledge of Java\n\nStrong knowledge of Go programming language, paradigms, constructs, and idioms\n\nFamiliarity with RESTful APIs\n\nExperience with Elastic and PostgreSQL\n\nExperience with Spring\n\nExperience using revision control system such as git\n\nFamiliarity with automated testing, Continuous Integration, and Continuous Delivery\n\nAbility to drive a feature or bug fix from discovery through to a stable deployment to production\n\nAbility to thrive in a fast-paced environment and multi-task efficiently\n\nAbility to work and collaborate in a team\n\nStrong analytical and troubleshooting skills]\n\nPreferred Qualifications\n\nAnother language such as Go,Python\n\nExperience with Full Stack Development\n\nExperience with distributed systems\n\nKnowledge of Javascript, React Js, D3 js",
    "location": "Vancouver, WA",
    "employer": "WiLine"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=224&ao=333798&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_9edd7f7d&cb=1560102074862&jobListingId=3256608530",
    "title": "Software Developer",
    "description": "The Full Stack Developer will participate in design, development, and maintenance of the Beckman Coulter’s multiple application services. The scope of the role includes the following:\nParticipate in the software development lifecycle of Beckman Coulter web and mobile applications including\nRequirements gathering\nSoftware Design\nPrototyping\nDevelopment\nTesting\nMaintenance\nSupport\nCollaboratively work within technical and business teams to identify solutions and generate associated software designs\nEffectively communicate status, solutions, and issues to both technical and non-technical audiences\nWork effectively within globally distributed teams\n\n\nAdditional Position Profile:\nRequires knowledge and experience in own discipline; still acquiring higher-level knowledge and skills\nBuilds knowledge of the company, processes and customers\nSolves a range of straightforward problems\nAnalyzes possible solutions using standard procedures; technical experience and judgement and precedents\nReceives a moderate level of guidance and direction\nRequires expanded conceptual knowledge in own discipline and broadens capabilities\nUnderstands key business drivers; uses this understanding to accomplish own work\nNo supervisory responsibilities but provides informal guidance to new team members\nImpacts quality of own work and the work of others on the team; works within guidelines and policies\nExplains complex information to others in straightforward situations\n\n\n#LI-SL1.\n\n\nBachelor’s degree in Computer Science with 2 years’ experience or Master’s degree in Computer Science with 0-2 years’ experience\nExperience on architecting and supporting applications\nExperience working as a software developer\nExcellent communication and the ability to translate stated and unstated stakeholder needs into solutions\n\n\nAbility to:\nevaluate and analyze existing software architectures\nlead the architecture and design reviews.\ndefine and document software interfaces.\nproduce code for prototypes, and production systems.\nlearn about, maintain and evolve existing systems and architectures. Redesign existing architectures to accommodate migration to new technologies and platforms.\npresent complex technical information to diverse audiences.\nTeam player, ability to work effectively in a matrix organization, with geographically dispersed team members\nSelf-starter, ability to envision solutions and take initiative to see the solution to the end despite challenges\nAbility to think strategically under the given constraints.\n\n\nRequired Core Skills:\nFull stack development, front end, back end, database, third party integrations, etc.\nStrong React/Redux experience\nStrong Node.js/Javascript experience\nAWS Cloud services with emphasis on serverless architecture (lambda, docker, Kubernetes)\nHTML/CSS/Javascript/AJAX\nREST and Microservice Architecture\nSQL and Common DBs (Oracle, MySQL, Postgres)\n\n\nRequired Software Engineering experience:\nArchitecture and detailed design\nSCM Tools (Git, SVN)/Branching Strategies\nGood documentation of code and design\nPerformance testing and tuning\nContinuous Integration and Deployment Tools (Jenkins Groovy)\nAgile experience\nOther optional but desired skills:\n\n\nJava\nSitecore\nElasticsearch\nJIRA and Confluence\nMicrosoft Teams\nSingle Sign On (SSO) with OpenID connect\n\n\nDiversity & Inclusion\n\n\nAt Danaher, we are dedicated to building and sustaining a truly diverse and inclusive culture. These are not just words on a page—Diversity and Inclusion is a top priority for the company, and it ties deeply to each of our core values. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
    "location": "Brea, CA",
    "employer": "Beckman Coulter"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=227&ao=389273&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_86384f8f&cb=1560102074866&jobListingId=3257634713",
    "title": "Independent Software Developer",
    "description": "Software Engineer Needs Description\n\nLHBA/BTS\n\nNeed: Software Developer experienced in React, Node, Typescript, Postgres\n\nReports to: BTS Executive Team\n\nNeeds Description\n\nBasketball Training Systems (BTS) www.basketballtrainingsystems.comimplements youth basketball programs around the country, a number of which are for NBA players.In our licensee facilities we use state of the art athlete tracking technology used by a number of NBA teams.The technology comes primarily from Kinexon Sports & Media Inc and RSPCT Basketball Technologies LTD; however BTS is intending to link data from Microsofts Lazer 9000 dribbling system and video technologies such as Pixelot and PlaySight in the future.BTS requires all of its vendors to open their APIs so that the information can be collected from each technology into a single repository for athletes using the systems.BTS has created something it calls its Digital Locker which allows athletes to retain and view their data anytime and anywhere.The DL is stored in AWS, and is built in React, Node, Typescript, and Postgres.\n\nWe are looking for an independent contract with whom we can grow the DL system.We anticipate this to be an ongoing project as we continue to add to and improve the experience in the DL; however, it does not currently warrant a full-time person.Consequently, we are looking for an independent contractor experienced in the above-languages that can be responsive, quick to get to solutions (note: this is customer facing and unexpected issues often needs quick turn-around time), able to articulate the time and costs of proposed improvements, manage to those expectations, and grow as we grow our DL members.\n\nRole\nAnalyze athlete data gathered with Kinexon and RSPCT stored on AWS\nContinue to build our Digital Locker user interface to\nmake the user interface easy and fun, and\nexpand the scope of data that we present to our members\nUnderstand the principles of gamification and interface design to improve our technology platform\nCollaborate with our staff to understand the Basketball Curriculum and its relationship to basketball technology.\nWork to design new interfaces and implement them.\nAddress and troubleshoot technology issues as they occur\nDatabase Design and administration\nSkills\nComputer programming skills, including React, Node, Typescript, Postgres\nDigital Interface Design\nUnderstand how to utilize tools in AWS\nData analysis & research\nMust be able to articulate technology issues to other team members who do not have the same level of technical background\nMust be able to organize a project into steps and report project status updates to executive team\nQualifications\nComputer programming skills, including React, Node, Typescript, Postgres\nHigh acumen for quantitative projects\nExperience in data modeling, statistical analysis, and experiment design\nCommunication\nCommunicate often\nSolicit regular feedback from staff regarding experience to improve DL tools\nGeneral\nEffectively, professionally, and creatively project and present our organizations image and product offering to local community and beyond\nExceptional communication skills\nA flexible and positive attitude\nJob Type: Contract\n\nExperience:\nSoftware Development: 3 years (Preferred)\nReact: 2 years (Preferred)\nLanguage:\nEnglish (Preferred)\nFull Time Opportunity:\nNo",
    "location": "Chesterfield, MO",
    "employer": "Basketball Training Systems LLC"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=228&ao=334514&s=58&guid=0000016b3d54776dbe75eb3f550b1929&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_8f78ae5b&cb=1560102074869&jobListingId=3224576898",
    "title": "Software Developer",
    "description": "Stanford University\\'s Department of Medicine,Division of Infectious Diseases is seeking a Software Developer to execute a range of programming tasks for the Stanford HIV Drug Resistance Database (HIVDB), including programming, analyzing, designing, developing, implementing, modifying, and maintaining computer programs. This is a key position in the laboratory of Dr. Robert Shafer to expand a widely used international resource. In this position, you will be one of three software developers working with a small group of clinical investigators and laboratory scientists. You will also be interacting with an international group of HIVDB users.\n\nHIV drug resistance testing is increasingly used in clinical, research, and public health laboratories worldwide to assist in the management of the 20 million individuals receiving HIV therapy. HIVDB has had an outsized effect on HIV drug resistance research because it combines the expertise of a few individuals with software technologies that scale to handle large numbers of user-defined queries or sequences submitted for interpretation.\n\nCreating a sustainable model that will scale with the expanding number of HIV drug therapy and drug resistance publications, will require novel approaches including text-mining, artificial intelligence, and crowd-sourcing. Your work will be instrumental in helping to transition HIVDB to a self-sustaining open resource for the community of clinicians, researchers, and public health laboratories that rely on the most up-to-date drug resistance data and knowledge.\n\nExample responsibilities\nParticipating in redesigning the HIV Drug Resistance Database by migrating backend code from Perl to Python and by using object relational mappers such as SQLAlchemy.\nExtending the HIV Drug Resistance Database schema towards a rich annotation of peer-reviewed publications whether or not the primary data from such publications are in the Database.\nDeveloping forms to enable the online contribution and quality control analysis of primary data by the authors of published papers.\nImprove our query pages to enable dynamic interactive data visualizations using JavaScipt libraries such as React, Relay, D3, and the GIS OpenLayers.\nEDUCATION & EXPERIENCE (REQUIRED)\n\nBachelor\\'s degree and three years of relevant experience or a combination of education and relevant experience.\n\nKNOWLEDGE, SKILLS AND ABILITIES (REQUIRED)\nCurrent knowledge of latest software and design standards.\nAbility to define and solve logical problems for technical applications.\nKnowledge of and ability to select, adapt, and effectively use a variety of programming methods.\nAbility to recognize and recommend needed changes in user and/or operations procedures.\nBasic knowledge of software engineering principles.\nStrong knowledge of at least one programming language.\nDESIRED QUALIFICATIONS\nMasters degree in Computer Science, Bioinformatics, or related field.\nInterest in publication.\nExperience with open-source / version control platforms.\nExperience with Infrastructure as a Service such as AWS.\nExcellent written communication skills.\nExpert programming skills in Python or ability to rapidly develop these skills.\nExperience at web development including HTML5, CSS, and JavaScript.\nExperience working with relational databases such as MySQL.\nExperience with Perl or ability to understand Perl code.\nAbility and desire to learn new skills.\nPHYSICAL REQUIREMENTS*\nConstantly perform desk-based computer tasks.\nFrequently sit, grasp lightly/fine manipulation.\nOccasionally stand/walk, writing by hand.\nRarely use a telephone, lift/carry/push/pull objects that weigh up to 10 pounds.\n- Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.\nWORKING CONDITIONS\n\nMay work extended hours, evening and weekends.\n\nWORK STANDARDS\nInterpersonal Skills Demonstrates the ability to work well with Stanford colleagues and clients and with external organizations.\nPromote Culture of Safety Demonstrates commitment to personal responsibility and value for safety; communicates safety concerns; uses and promotes safe behaviors based on training and lessons learned.\nSubject to and expected to comply with all applicable University policies and procedures, including but not limited to the personnel policies and other policies found in the University\\'s Administrative Guide, http//adminguide.stanford.edu.\nJob Familynformation Technology Services\nJob Series Software Developer\n\nExemption Exempt\nSchedule Full-time\n\nAdditional Information\nSchedule Full-time\nEmployee Status Regular\nRequisition ID 78960",
    "location": "Stanford, CA",
    "employer": "Stanford University School of Medicine"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=302&ao=3839&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_39ae96fb&cb=1560102143019&jobListingId=3256799593",
    "title": "Software Developer",
    "description": "The Full Stack Developer will participate in design, development, and maintenance of the Beckman Coulter’s multiple application services. The scope of the role includes the following:\nParticipate in the software development lifecycle of Beckman Coulter web and mobile applications including\nRequirements gathering\nSoftware Design\nPrototyping\nDevelopment\nTesting\nMaintenance\nSupport\nCollaboratively work within technical and business teams to identify solutions and generate associated software designs\nEffectively communicate status, solutions, and issues to both technical and non-technical audiences\nWork effectively within globally distributed teams\n\n\nAdditional Position Profile:\nRequires knowledge and experience in own discipline; still acquiring higher-level knowledge and skills\nBuilds knowledge of the company, processes and customers\nSolves a range of straightforward problems\nAnalyzes possible solutions using standard procedures; technical experience and judgement and precedents\nReceives a moderate level of guidance and direction\nRequires expanded conceptual knowledge in own discipline and broadens capabilities\nUnderstands key business drivers; uses this understanding to accomplish own work\nNo supervisory responsibilities but provides informal guidance to new team members\nImpacts quality of own work and the work of others on the team; works within guidelines and policies\nExplains complex information to others in straightforward situations\n\n\n#LI-SL1.\n\n\nBachelor’s degree in Computer Science with 2 years’ experience or Master’s degree in Computer Science with 0-2 years’ experience\nExperience on architecting and supporting applications\nExperience working as a software developer\nExcellent communication and the ability to translate stated and unstated stakeholder needs into solutions\n\n\nAbility to:\nevaluate and analyze existing software architectures\nlead the architecture and design reviews.\ndefine and document software interfaces.\nproduce code for prototypes, and production systems.\nlearn about, maintain and evolve existing systems and architectures. Redesign existing architectures to accommodate migration to new technologies and platforms.\npresent complex technical information to diverse audiences.\nTeam player, ability to work effectively in a matrix organization, with geographically dispersed team members\nSelf-starter, ability to envision solutions and take initiative to see the solution to the end despite challenges\nAbility to think strategically under the given constraints.\n\n\nRequired Core Skills:\nFull stack development, front end, back end, database, third party integrations, etc.\nStrong React/Redux experience\nStrong Node.js/Javascript experience\nAWS Cloud services with emphasis on serverless architecture (lambda, docker, Kubernetes)\nHTML/CSS/Javascript/AJAX\nREST and Microservice Architecture\nSQL and Common DBs (Oracle, MySQL, Postgres)\n\n\nRequired Software Engineering experience:\nArchitecture and detailed design\nSCM Tools (Git, SVN)/Branching Strategies\nGood documentation of code and design\nPerformance testing and tuning\nContinuous Integration and Deployment Tools (Jenkins Groovy)\nAgile experience\nOther optional but desired skills:\n\n\nJava\nSitecore\nElasticsearch\nJIRA and Confluence\nMicrosoft Teams\nSingle Sign On (SSO) with OpenID connect\n\n\nDiversity & Inclusion\n\n\nAt Danaher, we are dedicated to building and sustaining a truly diverse and inclusive culture. These are not just words on a page—Diversity and Inclusion is a top priority for the company, and it ties deeply to each of our core values. Danaher Corporation and all Danaher Companies are equal opportunity employers that evaluate applicants without regard to race, color, national origin, religion, sex, age, marital status, disability, veteran status, sexual orientation, gender identity, or other characteristics protected by law.",
    "location": "Denver, CO",
    "employer": "Devicor Medical Products"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=303&ao=359521&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_7af5b702&cb=1560102143021&jobListingId=3260358066",
    "title": "Independent Software Developer",
    "description": "Software Engineer Needs Description\nLHBA/BTS\nNeed: Software Developer experienced in?React, Node, Typescript, Postgres\n\nReports to: BTS Executive Team\nNeeds Description\nBasketball Training Systems (BTS)?www.basketballtrainingsystems.comimplements youth basketball programs around the country, a number of which are for NBA players.??In our licensee facilities we use state of the art athlete tracking technology used by a number of NBA teams.??The technology comes primarily from Kinexon Sports & Media Inc and RSPCT Basketball Technologies LTD; however BTS is intending to link data from Microsoft?s Lazer 9000 dribbling system and video technologies such as Pixelot and PlaySight in the future.??BTS requires all of its vendors to open their API?s so that the information can be collected from each technology into a single repository for athletes using the systems.??BTS has created something it calls its Digital Locker which allows athletes to retain and view their data anytime and anywhere.??The DL is stored in AWS, and is built in React, Node, Typescript, and Postgres.\nWe are looking for an independent contract with whom we can grow the DL system.??We anticipate this to be an ongoing project as we continue to add to and improve the experience in the DL; however, it does not currently warrant a full-time person.??Consequently, we are looking for an independent contractor experienced in the above-languages that can be responsive, quick to get to solutions (note: this is customer facing and unexpected issues often needs quick turn-around time), able to articulate the time and costs of proposed improvements, manage to those expectations, and grow as we grow our DL members.\nRoleAnalyze athlete data gathered with Kinexon and RSPCT stored on AWSContinue to build our Digital Locker user interface tomake the user interface easy and fun, andexpand the scope of data that we present to our membersUnderstand the principles of gamification and interface design to improve our technology platformCollaborate with our staff to understand the Basketball Curriculum and its relationship to basketball technology.Work to design new interfaces and implement them.Address and troubleshoot technology issues as they occurDatabase Design and administration\nSkillsComputer programming skills, including React, Node, Typescript, PostgresDigital Interface DesignUnderstand how to utilize tools in AWSData analysis & researchMust be able to articulate technology issues to other team members who do not have the same level of technical backgroundMust be able to organize a project into steps and report project status updates to executive team\nQualificationsComputer programming skills, including React, Node, Typescript, PostgresHigh acumen for quantitative projectsExperience in data modeling, statistical analysis, and experiment design\nCommunicationCommunicate oftenSolicit regular feedback from staff regarding experience to improve DL tools\nGeneralEffectively, professionally, and creatively project and present our organization?s image and product offering to local community and beyondExceptional communication skillsA flexible and positive attitude\nemail resume tocrolniak@basketballtrainingsystems.comfor consideration.?",
    "location": "Saint Louis, MO",
    "employer": "Basketball Training Systems"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=304&ao=134644&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_0e3eb67a&cb=1560102143021&jobListingId=3252461932",
    "title": "Software Developer - Jira Align",
    "description": "Our mission at Jira Align is to Simplify Software at Scale by bringing business and software development organizations together in one intuitive platform. From executives trying to weigh one investment versus another to program managers looking to optimize development capacity, Jira Align has the expertise to help companies scale up and improve software delivery because finding solutions through agility is what we were born to do.\n\nAs a Software Engineer, you’ll be a key contributor to the Jira Align Development Platform which includes Core Jira Align product enhancements, REST API and all our integrations. Ideally you will be a Software Craftsman and agilest that will provide guidance and hands-on development of internal development, test, and continuous integration processes. We’re primarily a .NET shop that develops in client and server side scripting, C#, and ASP.NET with SQL Server as the database.\n\nIf you have strong technical background, experience working with the Microsoft Stack, REST APIs, understand the challenges of integrating multiple systems, and know how to manage your work using agile methodologies, we want to talk to you!\n\nResponsibilities\nCollaborate with customers, partners, and internal product leadership to understand requirements for enhancing our Core Product, REST API and integrations.\nWork with on-shore and off-shore development teams to execute the stories in the backlog adhering to an agile process.\nDevelopment of APIs, integrations and Core Jira Align product development using .NET, C#, client and server side scripting, SQL Server, ADO.NET, ASP.NET Web API, and external system’s web services and SDKs.\nBring a QA mindset to your work, assisting the team with their continuous integration efforts using test and behavior driven development practices.\nSupport customers and partners in their usage of the development platform and integrations.\nRequirements\n3+ years development experience using the .NET stack.\nSelf-motivated with a “get it done” work ethic.\nAbility to not get lost in “analysis paralysis”.\nAbility to troubleshoot complex issues and provide timely solutions.\nProficient with front end languages including HTML, CSS, JavaScript, JQuery.\nExperience with JavaScript frameworks including Angular JS and React.\nExperience with server side languages including VBScript.\nExperience in designing/implementing RESTful web services\nProficient with MS-SQL database.",
    "location": "Austin, TX",
    "employer": "Atlassian"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=306&ao=189299&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_f2bd1266&cb=1560102143024&jobListingId=3258312419",
    "title": "Software Developer",
    "description": "Description\n\nThis position will be part of an agile development team building and working on defect resolution and feature enhancements to large scale software systems. This position will be involved in all areas of development from design to development to testing. It will provide exposure to working with the various tools, technologies, patterns and practices of implementing and maintaining enterprise software systems.\n\nResponsibilities\n\nAbility to use one or more software development languages (examples, C#, Java, HTML, etc.)\n\nAbility to understand and communicate SDLC principles\n\nAbility to understand and communicate basic software development concepts (examples, object-oriented design, relational databases, design patterns)\n\nAbility to understand and communicate common software architectural components, and their deployment and operation (examples, Web Applications, Web Services, Databases, etc.)\n\nAbility to understand and communicate common concepts of version control systems\n\nAbility to design and present clear development plans for executing changes to software systems\n\nStrong communication skills\n\nAttention to detail, and ability to identify problems\n\nAbility to work with Business Analysts to understand the requirements of assigned work\n\nAbility to work with QA Analysts to understand defects reported against assigned work\n\nMentor junior development staff on core competencies and technology skillsets\n\nTechnology Tools and Skillsets\n\nMicrosoft .NET and .NET Core (C#)\n\nASP.NET, MVC\n\nMicrosoft SQL Server\n\nJavaScript/ECMA/TypeScript\n\nWeb Client Frameworks and Package Management (Angular/React/Node.js)\n\nWeb Services, WCF/SOAP, REST\n\nSource Control, TFVC, Git\n\nWindows PowerShell\n\nWindows Server, IIS Hosting Environments\n\nSDL2017",
    "location": "Austin, TX",
    "employer": "National Western Life Insurance Company"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=307&ao=14295&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_4834b309&cb=1560102143025&jobListingId=2661611600",
    "title": "Software Developer (Variety of Roles",
    "description": "Write code that matters.\n\nFaithlife uses technology to help the church grow in the light of the Bible. We produce Logos Bible Software, Faithlife Groups, Proclaim Church Presentation Software, Faithlife TV video streaming, and more. We develop using C#, JavaScript, C++, Objective-C and Java, using .NET, Node.js, MySQL, Elasticsearch and React for web, Windows, macOS, iOS and Android.\n\nFaithlife is hiring software engineers for a variety of roles across our products and at both our locations: in Bellingham, Washington and Chandler, Arizona. To see the specific roles we have open, please check out faithlife.com/careers under Software Development.\n\nPlease note that Faithlife will not sponsor applicants for work visas.\n\nRequirements\nU.S. work authorization\nBachelor’s degree in Computer Science or equivalent experience\nAt least 1–2 years experience in a software development role\nC#, Java, C++, JavaScript or similar language\nPreferred Experience\nGit or similar DVCS\nReact + Redux\nMySQL or similar SQL database\nElasticsearch\nREST APIs\nUnit testing\nJenkins or similar continuous integration\nBenefits\nCompetitive salary\nUnlimited vacation time\nHealth insurance plan\n401(k) retirement plan with employer matching\nFree beverages and espresso",
    "location": "Bellingham, WA",
    "employer": "Faithlife"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=309&ao=447365&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_c89029d4&cb=1560102143027&jobListingId=3258165184",
    "title": "Software Developer II In Xbox Live",
    "description": "Are you interested in working on extraordinary technical challenges, applied to the fun world of gaming? Do you want to work with a group of passionate, fun people on unleashing game developers and community creativity?\n\nXbox Live is the leading gamer network spanning console, PC and mobile games and is central to Microsoft’s gaming strategy; its services power the breadth of social gaming experiences with Xbox Live clubs, achievements, leaderboards, community hubs, game hubs, game activity feed, and much more. Xbox Live has an exemplary future as it expands to serve many more scenarios where consumers, and creators build each other.\n\nResponsibilities\nWe are looking for a Software Development Engineer for the Xbox Live team who is creative, highly motivated, independent and innovative. You will need to be passionate about building experiences in the mobile, PC and web space while also building highly reliable, secure and scalable services that enable tens of millions of gamers to play online every day. Our bold charter is to build new, pioneering experiences on mobile, PC and web, and we need you to help us take that next step. You will be defining, prototyping and building new features, products and services. We will bring these innovations everywhere gamers are – PC, mobile, web, Xbox console and beyond.\n\nYou are uniquely positioned to deeply impact Xbox Live’s future and growth, gamers, and partner teams like Game Pass, Mixer and xCloud reach their goals.\nHelp us drive architecture, design, development of Xbox mobile and PC apps, and web experiences\nPartner with game studios – internally and externally, client and service teams to enable groundbreaking new experiences\nCollaborate with Xbox Live and partner organizations to support scenarios in gaming, social, security and more in the mobile, PC and web space.\nWork with teams across to experiment their features on the mobile and PC app.\nSelf-motivated and comfortable taking care of the ambiguity of V1 and incubation work\nQualifications\nWhat you'll need\n3+ years in development shipping products and services\nStrong technical capability, cross group teamwork and verbal interpersonal skills\nAbility to work independently and efficiently in a highly motivated team environment\nTo be adaptable and love dealing with ambiguity\nAt least a Bachelor’s Degree in Computer Science, related discipline or equivalent experience\nBonus points\nProven ability to deliver high-quality end-to-end experiences for developers and consumers\nPrevious experience shipping mobile or pc apps. C++, iOS, Android, Java, Swift, Objective-C, Typescript, React, React Native, React XP, Electron.\nPrevious experience shipping large-scale cloud services and developer platforms. C#, .NET/.NET Core, Visual Studio, REST.\n#xboxlivejobs\n\n#getjobs\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n\nXGAXGETXBL",
    "location": "Redmond, WA",
    "employer": "Microsoft"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=310&ao=447365&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_52bb6b5a&cb=1560102143028&jobListingId=3258312675",
    "title": "Software Developer in Xbox Live",
    "description": "Are you interested in working on extraordinary technical challenges, applied to the fun world of gaming? Do you want to work with a group of passionate, fun people on unleashing game developers and community creativity?\n\nXbox Live is the leading gamer network spanning console, PC and mobile games and is central to Microsoft’s gaming strategy; its services power the breadth of social gaming experiences with Xbox Live clubs, achievements, leaderboards, community hubs, game hubs, game activity feed, and much more. Xbox Live has an exemplary future as it expands to serve many more scenarios where consumers, and creators build each other.\n\nResponsibilities\nWe are looking for a Software Development Engineer for the Xbox Live team who is creative, highly motivated, independent and innovative. You will need to be passionate about building experiences in the mobile, PC and web space while also building highly reliable, secure and scalable services that enable tens of millions of gamers to play online every day. Our bold charter is to build new, pioneering experiences on mobile, PC and web, and we need you to help us take that next step. You will be defining, prototyping and building new features, products and services. We will bring these innovations everywhere gamers are – PC, mobile, web, Xbox console and beyond.\n\nYou are uniquely positioned to deeply impact Xbox Live’s future and growth, gamers, and partner teams like Game Pass, Mixer and xCloud reach their goals.\nHelp us drive architecture, design, development of Xbox mobile and PC apps, and web experiences\nPartner with game studios – internally and externally, client and service teams to enable groundbreaking new experiences\nCollaborate with Xbox Live and partner organizations to support scenarios in gaming, social, security and more in the mobile, PC and web space.\nWork with teams across to experiment their features on the mobile and PC app.\nSelf-motivated and comfortable taking care of the ambiguity of V1 and incubation work.\nQualifications\n\nWhat you'll need:\n3+ years in development shipping products and services\nStrong technical capability, cross group teamwork and verbal interpersonal skills\nAbility to work independently and efficiently in a highly motivated team environment\nTo be adaptable and love dealing with ambiguity\nAt least a Bachelor’s Degree in Computer Science, related discipline or equivalent experience\nBonus points\nProven ability to deliver high-quality end-to-end experiences for developers and consumers\nPrevious experience shipping mobile or pc apps. C++, iOS, Android, Java, Swift, Objective-C, Typescript, React, React Native, React XP, Electron.\nPrevious experience shipping large-scale cloud services and developer platforms. C#, .NET/.NET Core, Visual Studio, REST.\n#xboxlivejobs\n\n#getjobs\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n\nXGAXGETXBL",
    "location": "Redmond, WA",
    "employer": "Microsoft"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=311&ao=454823&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_a80b1ca2&cb=1560102143029&jobListingId=3257043800",
    "title": "Software Developer",
    "description": "Software Developer Robert Half is seeking a Software Developer on behalf of a client in the Wholesale Distribution industry. You'll be a great fit for this position if you excel in implementing new features, maintaining existing code, and refactoring existing code across a breadth of products used both internally and externally at the company. This long-term temporary-to-full-time employment opportunity is based in the Asheville, North Carolina area. Key responsibilities - Consistently enact code-review and join up with other developers - Maintain and develop new features to internal and external facing software to enhance the customer experience and resolve issues on various operating systems - Furnish clear and consistent information around solutions and time estimate to client-facing program management teams - Combine resources with Scrum team to contribute true work estimates - Solve and deliver production support- Less than one year of experience - Experience documenting, crafting, and testing APIs - Knowledge of education standards such as QTIAPIP, SIF, AIF - Experience with software development life cycles, e.g. Agile, Big Bang, Spiral, Waterfall, etc. - strongly preferred - Familiarity with scrum - strongly preferred - Ability to write clean, standardized code that performs optimally in highly concurrent environments - strongly preferred - React experience - Experience with at least one frameworklibrary, e.g. Vue.js, Polymer, Angular.js, React.js, Ractive.js, Knockout.js, Ember.js, Bootstrap, etc. - strongly preferred - We are particularly looking for candidates with familiarity with full-stack development (front-end, to middleapplication tier, to database) Qualified candidates are encouraged to apply now email Melissa.Phanrht.com for more information!",
    "location": "Asheville, NC",
    "employer": "Robert Half Technology"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=314&ao=37049&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_71aaed6e&cb=1560102143033&jobListingId=3258762270",
    "title": "Software Developer II",
    "description": "Power BI is a rising star at Microsoft that has rapidly disrupted and transformed the Business Intelligence market. We are looking for passionate web and full stack developers to create the next generation of BI experiences for Microsoft customers. Power BI is a modern interactive web app built on top of Azure, and the learning opportunities and are plentiful for the motivated individual. Come join us as we build the future of BI, analytics, and data insights.\n\nOur users need a rich, immersive experience across the desktop, web, and mobile that helps them effortlessly gain insights and make sense of the immense amounts of data being generated by their businesses. As a Power BI developer, you'll help solve many interesting challenges in the areas of fluid animations, responsive layout, beautiful data visualizations, scalable services and easy to understand experiences. We use the latest web technologies and push the boundary on performance. We love open source, and are constantly looking for opportunities to increase customer value or team productivity by onboarding open source projects.\n\nResponsibilities\n\nYou will be responsible for technical planning, implementation, and monitoring of your feature usage, as well as assisting with customer requests and incidents that may arise. We work close as a team, often pairing up on feature development, and also working closely with program managers, UX designers, and partner product teams.\n\nQualifications\n\nRequired:\nBachelor's degree in Computer Science, Engineering, or equivalent work experience\n3+ years of industry experience working on commercial software applications or services\n2 years of experience with C#, C++, Java, or TypeScript\n2 years of experience with JavaScript, HTML, and CSS\nPreferred:\n1 year of TypeScript\n1 year of AngularJS/Angular/React or similar\n1 year of git SCM\n\nMicrosoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.\n\nBenefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.\n\nbagjobs\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.",
    "location": "Bellevue, WA",
    "employer": "Microsoft"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=315&ao=4008&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_8b923805&cb=1560102143034&jobListingId=2664342999",
    "title": "Software Developer",
    "description": "Overview\n\nWalter P Moore is an international company of engineers, architects, innovators, and creative people who solve some of the world’s most complex structural and infrastructure challenges. Providing structural, diagnostics, civil, traffic, parking, transportation, enclosure, and construction engineering services, we design solutions that are cost- and resource-efficient, forward-thinking, and help support and shape communities worldwide. Founded in 1931 and headquartered in Houston, Texas, our 600+ professionals work across 20 U.S. offices and five international locations.\n\nResponsibilities\n\nWe are in need of a talented Software Developer to join our Houston, TX based software development team to create and maintain custom web based and windows based applications. The right person for this position will possess a strong can-do attitude and provide exceptional client service while using their analytical, problem-solving and project management skills.\n\nQualifications\n\nRequired Qualifications\n1+ years web development experience (both MVC and Web Forms) C# on .NET Stack\n1+ years of experience using Microsoft Visual Studio\nVery strong communication skills\n1+ years SQL/Relational database experience\n1+ years JavaScript experience\n1+ using css/bootstrap to create responsive web designs\nPreferred Qualifications:\nGit\nobject-oriented design / implementation,\nContinuous Integration\nPowerShell Scripting\nSencha Framework (touch and EXT JS)\nReact JS\nSharePoint development experience\nWalter P Moore is an equal opportunity employer and provides all employees with a competitive benefits and compensation package.",
    "location": "The Woodlands, TX",
    "employer": "Walter P. Moore and Associates"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=318&ao=66506&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_ac0bb332&cb=1560102143037&jobListingId=3258349825",
    "title": "Software Developer",
    "description": "Company Description\n\nWiLine Networks is a global leading provider of fast, flexible, affordable communications services solutions to businesses, building owners, wholesale providers. We offer configurable solutions that empower our customers to select the right combination of bandwidth and services to maximize productivity. Through a single broadband connection over our private network, we deliver voice, data, video and mobility solutions.\n\nJob Description\n\nWe are looking for a Java developer responsible for building Java applications. This includes anything between complex groups of back-end services and their client-end (desktop and mobile) counterparts. Your primary responsibility will be to design and develop these applications and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality are essential.\nWe are also looking for a great Go developer who possesses a strong understanding of how best to leverage and exploit the languages unique paradigms, idioms, and syntax.\n\nResponsibilities\n\nTranslate application storyboards and use cases into functional applications\n\nDesign, build and maintain efficient, reusable, and reliable Java code\n\nEnsure the best possible performance, quality, and responsiveness of the applications\n\nIdentify bottlenecks and bugs, and devise solutions to these problems\n\nHelp maintain code quality, organization, and automatization\n\nSkills\n\nA minimum of 2 years relevant development using Java\n\nStrong knowledge of Java\n\nStrong knowledge of Go programming language, paradigms, constructs, and idioms\n\nFamiliarity with RESTful APIs\n\nExperience with Elastic and PostgreSQL\n\nExperience with Spring\n\nExperience using revision control system such as git\n\nFamiliarity with automated testing, Continuous Integration, and Continuous Delivery\n\nAbility to drive a feature or bug fix from discovery through to a stable deployment to production\n\nAbility to thrive in a fast-paced environment and multi-task efficiently\n\nAbility to work and collaborate in a team\n\nStrong analytical and troubleshooting skills]\n\nPreferred Qualifications\n\nAnother language such as Go,Python\n\nExperience with Full Stack Development\n\nExperience with distributed systems\n\nKnowledge of Javascript, React Js, D3 js",
    "location": "Vancouver, WA",
    "employer": "Wiline PMU"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=320&ao=66506&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_106a3679&cb=1560102143039&jobListingId=3258349804",
    "title": "Software Developer",
    "description": "Company Description\n\nWiLine Networks is a global leading provider of fast, flexible, affordable communications services solutions to businesses, building owners, wholesale providers. We offer configurable solutions that empower our customers to select the right combination of bandwidth and services to maximize productivity. Through a single broadband connection over our private network, we deliver voice, data, video and mobility solutions.\n\nJob Description\n\nWe are looking for a Java developer responsible for building Java applications. This includes anything between complex groups of back-end services and their client-end (desktop and mobile) counterparts. Your primary responsibility will be to design and develop these applications and to coordinate with the rest of the team working on different layers of the infrastructure. Thus, a commitment to collaborative problem solving, sophisticated design, and product quality are essential.\nWe are also looking for a great Go developer who possesses a strong understanding of how best to leverage and exploit the languages unique paradigms, idioms, and syntax.\n\nResponsibilities\n\nTranslate application storyboards and use cases into functional applications\n\nDesign, build and maintain efficient, reusable, and reliable Java code\n\nEnsure the best possible performance, quality, and responsiveness of the applications\n\nIdentify bottlenecks and bugs, and devise solutions to these problems\n\nHelp maintain code quality, organization, and automatization\n\nSkills\n\nA minimum of 2 years relevant development using Java\n\nStrong knowledge of Java\n\nStrong knowledge of Go programming language, paradigms, constructs, and idioms\n\nFamiliarity with RESTful APIs\n\nExperience with Elastic and PostgreSQL\n\nExperience with Spring\n\nExperience using revision control system such as git\n\nFamiliarity with automated testing, Continuous Integration, and Continuous Delivery\n\nAbility to drive a feature or bug fix from discovery through to a stable deployment to production\n\nAbility to thrive in a fast-paced environment and multi-task efficiently\n\nAbility to work and collaborate in a team\n\nStrong analytical and troubleshooting skills]\n\nPreferred Qualifications\n\nAnother language such as Go,Python\n\nExperience with Full Stack Development\n\nExperience with distributed systems\n\nKnowledge of Javascript, React Js, D3 js",
    "location": "Vancouver, WA",
    "employer": "VoiceCo"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=321&ao=359521&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_4364e96d&cb=1560102143039&jobListingId=3260109368",
    "title": "Software Developer",
    "description": "Robert Half Technology is looking for a full time Web Developer in the downtown New Orleans, LA area. This is a salaried role offering a great overall compensation plan! This company is seeking an innovate software engineer to design and develop technical solutions within a team environment. The perfect candidate will have at least 3 years of .NET experience using ASP.NET MVC and C. The developer will be working in a full stack capacity with JavaScript, CSS, HTML. A Bachelor's degree is required. Modern JavaScript frameworks (React, Angular, Vue) are a huge plus! Send your resume to Sara sara.bechrht.comJavaScript, CSS, HTML. A Bachelor's degree is required. Modern JavaScript frameworks (React, Angular, Vue) are a huge plus!",
    "location": "New Orleans, LA",
    "employer": "Robert Half Technology"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=322&ao=177702&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_96adc909&cb=1560102143040&jobListingId=3191472655",
    "title": "Software Developer - Web Frontend",
    "description": "Overview\n\nAre you passionate about creating good user experiences on the web? So are we! In the past few years, Esri has put a large effort into making design tools accessible and powerful for experts, stakeholders, and the public. We are dedicated to continually pushing the boundaries of GIS, and you can play a key role in our mission.\n\nAt Esri, we develop web applications based on our ArcGIS API for JavaScript. Join our team of exceptional software engineers to design and implement our next generation of web GIS applications, our JavaScript API, and our cloud solution ArcGIS Online.\n\nResponsibilities:\nDevelop the UX/UI of a new suite of web apps\nConceptualize, design, implement, and test innovative user interface components on top of our JavaScript API\nWork closely with JavaScript API software developers and product engineers in a highly interactive and creative environment\nInteract with users to identify and articulate their needs\nResearch and apply state-of-the-art UX practices\nRequirements\nExcellent JavaScript/HTML/CSS skills and good sense for software architecture\n2+ years of industry experience in UX/UI development including hands-on product design, team programming, and experience with building and shipping software products\nStrong passion for detailed, innovative, and empathic design, combined with well-rounded design skills (interaction, UI, visual, and motion design)\nExcellent spatial sense and a good intuition for the aesthetics and technical aspects of information visualization or cartography\nExcellent communiction skills to clearly articulate the reasons behind design decisions\nAbility to work in a fast-paced team environment with frequent releases and tight schedules\nBachelor’s or master’s in computer science, engineering, mathematics, GIS, or related field, depending on position level\nRecommended Qualifications:\nExperience with some of these web technologies: TypeScript, ES6, Ember, Angular, React\nExperience with CSS post-processing\nExperience with accessibility\nExperience with internationalization\nFamiliarity with GIS applications and technologies\n#LI-JO1\nThe Company\n\nOur passion for improving quality of life through geography is at the heart of everything we do. Esri’s geographic information system (GIS) technology inspires and enables governments, universities, and businesses worldwide to save money, lives, and our environment through a deeper understanding of the changing world around them.\n\nCarefully managed growth and zero debt give Esri stability that is uncommon in today's volatile business world. Privately held, we offer exceptional benefits, competitive salaries, 401(k) and profit-sharing programs, opportunities for personal and professional growth, and much more.\n\nEsri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law.\n\nIf you need a reasonable accommodation for any part of the employment process, please email humanresources@esri.com and let us know the nature of your request and your contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this e-mail address.",
    "location": "Redlands, CA",
    "employer": "Esri"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=325&ao=447365&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_137316c5&cb=1560102143043&jobListingId=3257182729",
    "title": "Software Developer",
    "description": "Job Description\nBuild and maintain desktop and mobile apps for Sharpened Productions, a fast-growing web and software development company based in Minneapolis, MN. Use your software development abilities to their fullest potential while learning new skills at the same time.\n\nResponsibilities\nDevelop and maintain apps for Windows and Android\nRequired Skills\nAndroid development (Android Studio)\nWindows .NET development (Visual Studio, WinForms, UWP)\nJava\nC#\nDesired Skills\nAndroid Native Development Kit (NDK)\nCross-platform mobile development frameworks (Xamarin, React Native)\nmacOS development (Xcode)\niOS development (Xcode)\nWeb development (HTML, CSS, JavaScript)\nWeb scripting (PHP, MySQL)\nC/C++\nDelphi\nImage editing\nApplicant Requirements\nHighly detail-oriented\nExceptionally creative\nSelf-motivated",
    "location": "Minneapolis, MN",
    "employer": "Sharpened Productions"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=327&ao=14295&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_15aabf55&cb=1560102143045&jobListingId=3150763756",
    "title": "Software Developer",
    "description": "Job Description:\n\nSkills:-\n\nSpring boot -must have\n\nMicro services – (nice to have)\n\nREST services - must have\n\nMongo db(nice to have) but should have experience with document base DB\n\nReact JS - must have\n\njava - must have\n\nTest Driven – J unit, unit test/integration testing- must have\n\nGIT, bit bucket (nice to have)\n\nOpen shift (nice to have)\n\nJIRA/Agile -should know\n\nUI/UX experience a plus (nice to have)\n\nJob Description:\n\nSkills:-\n\nSpring boot -must have\n\nMicro services – (nice to have)\n\nREST services - must have\n\nMongo db(nice to have) but should have experience with document base DB\n\nReact JS - must have\n\njava - must have\n\nTest Driven – J unit, unit test/integration testing- must have\n\nGIT, bit bucket (nice to have)\n\nOpen shift (nice to have)\n\nJIRA/Agile -should know\n\nUI/UX experience a plus (nice to have)",
    "location": "Franklin, TN",
    "employer": "Macropace Technologies"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=328&ao=66506&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_5a4dc306&cb=1560102143046&jobListingId=3256230691",
    "title": "Software Developer",
    "description": "Are you looking for a new opportunity with a great company using the latest technologies? Look no further. As an innovator and leader in the express automatic car wash industry, Tommy Car Wash Systems works to continually advance car wash technology and site design. We are known for our comprehensive site development services, stainless steel arches, cutting-edge Totally Tommy facility design, and Tommy's Express franchise program.\n\nAs a member of the Tommy Car Wash Systems Innovation Group, you'll be working with our team of developers on consumer-facing products for car wash customers, owners, and managers in the USA and abroad. Our focus is on the modern, digital customer experience and business management.\n\nWhat You'll Do:\n\nBuild efficient, high-performing web systems and mobile apps\n\nWrite efficient, clean, readable, fast, testable, documented, monitored code and systems\n\nDeliver new features to production\n\nContribute to the product development, mission, and success way beyond checking off development tasks\n\nCollaborate with other developers to deliver compelling user-facing products\n\nWork closely with internal and external team members to achieve our mission\n\nShip code often in a fast-paced agile environment with continuous deployment\n\nWhat We're Looking For:\n\nA BS/MS in Computer Science or related degree\n\nStrong experience with React, Redux, Node.js\n\nDatabase experience with PostgresSQL\n\nIOS/Android Development Experience\n\nSQL proficiency and Database database experience with PostgresSQL, MySQL, SQL Server\n\nExperience with Amazon AWS, Azure Cloud or other cloud hosting services\n\nExperience writing integration and unit tests\n\nStrong problem-solving skills and ability to learn/adapt to new technologies\n\nTop-notch communication skills\n\nPassion for building great software\n\nWhat We Offer:\n\nMedical\nDental\nVision\nVacation\n401K with Company Match\nAccident and Life Insurance\n\nTommy Car Wash Systems develops proven car wash equipment, facilities, and operations strategies which are on the leading edge of the industry. Our packages are built to be stunning, efficient, modern, and above all, successful. Our team has developed hundreds of state-of-the-art facilities around the world.\n\nWe are a drug-free company. Must be able to fulfill essential job function in a consistent state of alertness and safe manner. Apply at https://essenburgcarwashofholland.bamboohr.com/jobs/view.php?id=37\n\nThis position will be based in our Holland, Michigan office.",
    "location": "Holland, MI",
    "employer": "Visionquest Companies"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=329&ao=182759&s=58&guid=0000016b3d5581abae6783aa05e58472&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_cc76af81&cb=1560102143046&jobListingId=3257202168",
    "title": "#Software Developer - Entry Level - Cherry Hill, NJ - Rate Open",
    "description": "Job Title Software Development DeveloperLocation Cherry Hill, NJDuration C2HRate $OpenResponsibilities - You'll design and create solutions on the web tier, server-side using Java You'll write optimal front-end code using JS, CSS and HTML Write unit tests and automated integration tests You will perform Code Reviews and ensure the team adheres to best practices You will investigate, debug and resolve live site issues Technical Skills - You should have strong knowledge in Java, JavaScript, HTML, CSS, design patterns, data structures Experience with React and Scala will be an advantage Experience with test frameworks such as JUnit and Ruby/ Cucumber is a plus. Qualifications - A bachelor's or master's degree in computer science, computer engineering, or a related major and/or equivalent work experience Experience with agile development methodology preferred 1-3+ years of experience in software engineering. Note If interested please send your updated resume and include your rate/salary requirement along with your contact details with a suitable time when we can reach you. If you know of anyone in your sphere of contacts, who would be a perfect match for this job then, we would appreciate if you can forward this posting to them with a copy to us.We look forward to hearing from you at the earliest!",
    "location": "Cherry Hill, NJ",
    "employer": "Two95 International Inc."
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=401&ao=4120&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_a7164492&cb=1560102210932&jobListingId=3031386103",
    "title": "Full Stack Software Developer",
    "description": "Job Description:\n\nDataOne Software (dataonesoftware.com), a Dominion Enterprises company, is seeking a talented, versatile, and entrepreneurial Full-Stack PHP/MySQL/Angular Developer for our Beverly, MA office.\n\nThis is an excellent opportunity to join a small, highly productive team and make a meaningful impact. DataOne is an established and successful business, but we have not lost our entrepreneurial spirit and culture. Each of our software developers has a high degree of autonomy, a broad range of responsibilities, and makes direct, valuable contributions to the business. We hire self-motivated professionals who know how to create value, and we work tirelessly to enable and support their success.\n\nWe operate a professional development shop. Our team uses GitHub for source control, we have automated deploys, we write automated tests, and we peer review all code before it hits production. We offer a supportive, collaborative environment, superb work-life balance, coaching to help you reach your full potential, and opportunities for career advancement. In return we expect talent, creativity, professionalism, and a strong drive to succeed.\n\nApplicants should have the following:\nA degree in Computer Science, Engineering, a related field, or equivalent work experience\nSome experience programming on your own time (non-academic, non-professional) strongly preferred\nMastery of one or more object-oriented programming languages\nMastery of SQL fundamentals and relational database design concepts\nExperience with PHP, HTML, CSS, and Javascript. Experience with Angular or React preferred.\nA positive attitude and entrepreneurial spirit\nThis job may be for you, if:\nYou're relatively new to Software Development but want serious responsibility and influence\nYou pay excellent attention to detail\nYou enjoy solving problems, both independently and collaboratively\nYou're known for your integrity and professionalism\nYou value work-life balance\nYou enjoy weekly team lunches and strong camaraderie\nThis is a full-time position at our Beverly, MA office, not a freelance / telecommute opportunity. No recruiters, please.\n\nAbout DataOne Software\n\nFor over a decade DataOne Software, a Dominion Enterprises Company, has been creating innovative data and software products that are utilized across the automotive industry.\nWe are committed to providing a best in class product experience to our customers. Our solutions are used to market, sell, manage and service millions of vehicles throughout\nNorth America. We are also passionate about our employees. We like to think of our corporate culture as offering the best of both worlds, with the positive, can-do approach\nof a profitable, fast growing business combined with the backing and security of a large corporate presence. We take pride in maintaining a dynamic and collaborative work\nenvironment where employees can thrive, impact our business and realize their potential.\n\nDominion Enterprises is an Equal Opportunity Employer and supports Workplace Diversity. Drug Testing Employer.",
    "location": "Beverly, MA",
    "employer": "DataONE Software"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=407&ao=389273&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_ae401079&cb=1560102210938&jobListingId=3257640249",
    "title": "Software Developer",
    "description": "Job Description\n\nBrock Solutions is an innovative engineering solutions and professional services company specializing in the design, build and implementation of real-time solutions for broad based industrial/manufacturing and transportation/logistics organizations worldwide. Some interesting areas we are exploring include industrial automation, machine learning, IIOT, cyber security, AI, robotics, and other technologies. With approximately 500 employees globally, Brock Solutions is a privately held, employee owned organization with over 30 years in the real-time solutions space.\n\nAs Brock Solutions continues to grow and respond to the on-going requirements of major clients, we need to add talent to our base of outstanding professionals. We are currently seeking a Software Developer to join our team of experienced professionals located at our office in Winston Salem, NC.\n\nWorking with other highly motivated Developers, you will be involved in the entire cycle of the software engineering process.\n\nResponsibilities:\nDesign, develop and maintain multiple applications and services\nDevelop reporting capabilities utilizing your experience with database design and development\nPerform system configuration and integrate software solutions into controls systems\nDetect, report, investigate, and fix defects\nParticipate in cross-functional code walkthroughs/reviews\nRequirements analysis, design, development, testing, commissioning, and training\nPerform other duties as assigned by Project Manager\nQualifications:\nBachelors degree in Mechatronics, Systems Engineering, Software Engineering, Computer Science or related fields\nExperience with an object-oriented language is required. C# or Java is preferred, but C++ and other languages are also acceptable.\nProficiency with SQL, ASP.NET, HTML, CSS and JavaScript is desired\nKnowledge of Python, Xamarin or React is an asset\nExcellent communication skills, both verbal and written\nStrong database design and programming skills with a passion for real-time systems\nPlease note this position may require travel (approximately 0-30%)\nNew grads are welcome to apply. If you have graduated within the last 3 years, please also submit a soft copy of your transcript (unofficial copy is fine).\n\nBrock Solutions strives to create a respectful, accessible and inclusive work environment. Upon individual request, Brock Solutions will endeavour to remove barriers to the hiring process to accommodate those candidates with disabilities.\n\nPlease apply on our website at https://careers.brocksolutions.com/Careers.aspx?req=SW-DEV-NC-19\n\nJob Type: Full-time",
    "location": "Winston-Salem, NC",
    "employer": "Brock Solutions"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=411&ao=55938&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_f8bf07ef&cb=1560102210942&jobListingId=3257344719",
    "title": "Software Developer",
    "description": "Job Requisition ID: 14866\n\nAdditional Locations:\n\nHMH Software Engineering – Software Engineering\n\nHMH Software Engineering provides cutting edge, individualized learning experiences to millions of students across the United States. We are as driven by this mission as we are by continuously improving ourselves and the way we work. Our offices are high energy, collaborative bee hives of activity where work is centered on small, autonomous teams that build great software. We trust each other, hold ourselves and our teammates accountable for results, and improve student outcomes with each release.\n\nAt HMH we constantly experiment with new approaches and novel ways of solving problems. We often succeed and sometimes stumble – either way we learn and move forward with more confidence than we had the day before. We are as passionate about new technologies and engineering craftsmanship as we are about transforming the EdTech industry itself.\n\nWe’re not just looking for hands on a keyboard to pound out code, we’re looking for talented teammates and colleagues who contribute as much as they receive and thrive working with us.\n\nIf this sounds like you let’s talk.\n\nThe Opportunity - Software Engineer\nSoftware Engineers personify the notion of constant improvement as they work with their team to build software that delivers on our mission to improve student outcomes. You’re not afraid to try new things even if they don’t work out as expected. You are independent, self-directed, high energy and as eager to contribute to your team as you are to progress on your own path to software craftsmanship. You’ll thrive working in a fast-paced, low friction environment where you’ll be exposed to a wide range of cutting edge technologies.\n\nResponsibilities:\nWork collaboratively as part of a software development team producing software that advances our core mission.\nEagerly learn and apply new cutting-edge technologies like functional programming, distributed computing, machine learning, advance data engineering, and serverless computing.\nTake responsibility for critical components of our solutions.\nContribute to our engineering culture and ever-improving concept of engineering best practices\n\nSuccessful Candidates must demonstrate an appropriate combination of:\nLogical and systematic problem solving skills\nAbility to work collaboratively and effectively in small team and cross-functional environments\nExperience and knowledge working with technologies and concepts such:\nJVM-based languages such as Java\nUI frameworks such as Angular and React\nWeb technologies such as Node.js, JavaScript, CSS, and HTML\nDevelopment frameworks such as Spring Boot\nArchitectural concepts such as microservices and separation of concerns\nContainer technologies such as Docker and Kubernetes\nDevelopment tools such as Github, and Jira\nDatabase technologies such as SQL, Aurora, and Redshift\nCloud technologies such as AWS and Azure\nOperating frameworks such as Apache Mesos, Apache Kafka, Apache Spark, and Amazon Kinesis\nRequired Education:\nHigh School/GED Graduate\nPhysical Requirements\nMight be in a stationary position for a considerable time (sitting and/or standing).\nThe person in this position needs to move about inside the office to access file cabinets, office machinery, etc.\nConstantly operates a computer and other office productivity machinery, such as a calculator, copy machine, and computer printer.\nMust be able to collaborate with colleagues via face to face, conference calls, and online meetings.\nABOUT US:\nHoughton Mifflin Harcourt (NASDAQ:HMHC) is a global learning company dedicated to changing people’s lives by fostering passionate, curious learners. As a leading provider of pre-K–12 education content, services, and cutting-edge technology solutions across a variety of media, HMH enables learning in a changing landscape. HMH is uniquely positioned to create engaging and effective educational content and experiences from early childhood to beyond the classroom. HMH serves more than 50 million students in over 150 countries worldwide, while its award-winning children's books, novels, non-fiction, and reference titles are enjoyed by readers throughout the world.\n\nFor more information, visit http://careers.hmhco.com\n\nPLEASE NOTE:\nHoughton Mifflin Harcourt is an equal employment opportunity employer and participates in E-Verify. All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of gender, race/ethnicity, gender identity, sexual orientation, protected veteran status, disability, or other protected group status.",
    "location": "Boston, MA",
    "employer": "Houghton Mifflin Harcourt"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=418&ao=334514&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_31b15d91&cb=1560102210949&jobListingId=3185839857",
    "title": "Software Engineer (Software Developer 2)",
    "description": "Stanford University, one of Silicon Valley\\'s largest and unique employers, is recruiting an experienced and energetic Software Engineer within the Department of Biomedical Data Science of the School of Medicine. Stanford\\'s mission is to educate future leaders and promote interdisciplinary, world-class research and teaching. This passion makes Stanford an intensely creative and rewarding place to work.\n\nThis outstanding Software Engineer will assume a leadership role in a large NIH-funded project to create open-source web-based and desktop software to annotate, store, search, and process biomedical images. This exciting work will enable researchers to discover image-based indicators of disease that will transform medical care. The software developed will become part of a national infrastructure supporting biomedical research, and will have high impact throughout the medical community. The Software Engineer will be responsible for designing, developing and documenting the software, working with collaborators and users to understand and implement the requirements, and evaluating and disseminating the software. The successful candidate will be self-directed, thrive in a stimulating collaborative research environment, work well with other developers, and be excited by the opportunity to assume an ownership role in creating software infrastructure that will be adopted by medical centers nationally. The candidate will work closely with faculty, research associates, students, developers, and other collaborators.\n\nDuties include\nConceptualize design, implement, and develop solutions for complex system/programs independently.\nWork with a variety of users to gain information, and develop intra-system tradeoffs between different users, as necessary; interact with a diverse client base and outside vendor contacts.\nDocument system builds and application configurations; maintain and update documentation as needed.\nProvide technical analysis, design, development, conversion, and implementation work.\nWork as a project leader, as needed, for projects of moderate complexity.\nServe as a technical resource for applications.\nCompare, evaluate, and implement new features and technologies, and integrate them into the computing environment.\nFollow team software development methodology.\nMentor lower level software developers.\n- Other duties may also be assigned.\nDESIRED QUALIFICATIONS\nStrong proficiency in JavaScript/ES6, including DOM manipulation and the JavaScript object model\nReal-world experience with Frameworks and Run-time experience environments (React, Node, Angular)\nUnderstanding of React.js and its core principles is a plus\nEDUCATION & EXPERIENCE (REQUIRED)\n\nBachelor\\'s degree and five years of relevant experience, or a combination of education and relevant experience.\n\nKNOWLEDGE, SKILLS AND ABILITIES (REQUIRED)\nExpertise in designing, developing, testing, and deploying applications.\nProficiency with application design and data modeling.\nAbility to define and solve logical problems for highly technical applications.\nStrong communication skills with both technical and non-technical clients.\nAbility to lead activities on structured team development projects.\nAbility to select, adapt, and effectively use a variety of programming methods.\nKnowledge of application domain.\nCERTIFICATIONS & LICENSES\n\nNone\n\nPHYSICAL REQUIREMENTS*\nConstantly perform desk-based computer tasks.\nFrequently sit, grasp lightly/fine manipulation.\nOccasionally stand/walk, writing by hand.\nRarely use a telephone, lift/carry/push/pull objects that weigh up to 10 pounds.\n- Consistent with its obligations under the law, the University will provide reasonable accommodation to any employee with a disability who requires accommodation to perform the essential functions of his or her job.\nWORKING CONDITIONS\n\nMay work extended hours, evening and weekends.\nAdditional Information\nSchedule Full-time\nEmployee Status Regular\nRequisition ID 79843",
    "location": "Stanford, CA",
    "employer": "Stanford University School of Medicine"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=424&ao=226479&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_d20ef761&cb=1560102210955&jobListingId=3259507019",
    "title": "Software Developer 2",
    "description": "RESPONSIBILITIES:\n\nKforce has a client in search of a Software Developer 2 in Mountain View, California (CA).\n\nREQUIREMENTS:\n2 to 3 years of experience with building front-end applications using React\nExperience with React, Redux, Apollo, etc.\nExperience with HTML, CSS\nWorking knowledge with GitHub\nStrong analytical and problem-solving skills\nTeam player\nKforce is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.",
    "location": "Mountain View, CA",
    "employer": "Kforce"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=426&ao=442378&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_d367e5d0&cb=1560102210956&jobListingId=3253489207",
    "title": "API Software Developer",
    "description": "Company Description\n\nnull\nJob Description\n\nA large part of the promise of online training is the ability to learn on your own schedule, rather than being bound by traditional classrooms. Were stretching the boundaries of where a person can learn by delivering applications for a variety of devices that help individuals learn wherever they are. Were looking for someone to help us deliver the APIs that enable learning through Pluralsight anywhere on the planet.\n\nThe Pluralsight as a Service offering will enable enterprises to integrate their learning, productivity, and people systems as they leverage Pluralsight as their technology skills system of record. PaaS will enable technologists and innovators to leverage the features on our platform in new and exciting ways to build better and more customized ways to measure Time to Effective Applied Learning (TTEAL) for their technology teams.\n\nWere looking for someone with:\n5 or more years of software engineering experience\nPassion for building reliable, maintainable software\nStrong drive to continually improve\nExperience building and monitoring APIs and services\nExperience with API management and Platform as a Service\nWhat youll do:\nBuild a streamlined developer PaaS Experience\nInteract with engineers and development teams across Pluralsight to build and expand our PaaS platform.\nWork with a team to deliver learning experiences to a worldwide audience\nBalance stability and innovation to continually improve existing products\nWork closely with customers and product management to build features our users want\nWays we work:\nSoftware Craftsmanship - we want to be proud of our work. Come to utahsc.org\nTest-Driven Development - we take responsibility for our code without QA engineers\nPair programming - we value collaborative development\nContinuous Delivery - teams independently ship code to prod every day\nKanban & Lean - no more backlog grooming, no more T-shirt size estimating\nContinual improvement - we take time to sharpen the saw and adjust how we work\nAutonomous & responsible teams - making their own product & dev choices\nCross-functional teams - collaborating through all phases of the product dev process\nCustomer research - we build what our customers actually want\nTrusting leaders - who trust us to create and dont impose deadlines or features\nSolid technology - of the teams choice, for the right job\nWhat we create with:\nNode.js\nJava\nReact\nGoogle Apigee\nMicrosoft Azure API Management\nAmazon AWS API Gateway\nPostgreSQL\nGitHub\nTeamCity\nOctopus\nWorking at Pluralsight\n\nFounded in 2004 and trusted by Fortune 500 companies, Pluralsight is the technology skills platform organizations and individuals in 150+ countries count on to create progress for the world.\n\nOur platform helps technologists master their craft and take control of their careers. We empower businesses everywhere to build adaptable teams, speed up release cycles and become scalable, reliable and secure. We come to work everyday knowing were helping our customers build the skills that power innovation.\n\nAnd we dont let fear, egos or drama distract us from our mission. Our mission to democratize technology skills is what drives us and our values are at the helm of how we work together. Its our commitment to practicing them day in, day out that enables our performance. Were adults, and we treat each other that way. We have the autonomy to do our jobs, transparency to eliminate office politics and trust each other to do the right thing. We thrive in an environment with creativity around every corner, challenges that keep us on our toes, and peers who inspire us to be the best we can be. We bring different viewpoints, backgrounds and experiences, and united by our mission, we are one.\n\nBring yourself. Pluralsight is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status.\n\n",
    "location": "South Jordan, UT",
    "employer": "Pluralsight"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=428&ao=134165&s=58&guid=0000016b3d568b88b97b7cc08a724529&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_560bc125&cb=1560102210958&jobListingId=3253403284",
    "title": "Software Developer",
    "description": "Company Description\n\nXactware, a Verisk business, specializes in technologies for the property insurance, remodeling, restoration, and mortgage and lending industries. Xactware’s tools provide claims estimating, contents replacement, claims management, and property maintenance solutions for desktop, mobile, and online platforms. Xactware’s services include repair cost research and reports, aerial imagery, and real-time business intelligence. Xactware has been providing cloud services for customers since 1995. To learn more about Xactware please visit us at: Xactware.com. We are proud to be a part of the Verisk family of companies!\n\nWith a history of impressive growth, an innovative culture, and offering industry-leading solutions, Verisk Analytics is an amazing place to work and make a difference. In 2018, Forbes magazine named Verisk to its World’s Best Employers list and, in 2017, to its World’s Most Innovative Companies list for the third consecutive year. We also earned the Great Place to Work® Certification for the third consecutive year in recognition of our outstanding workplace culture.\n\nVerisk is a leading data analytics provider serving customers in insurance, energy and specialized markets, and financial services. Using advanced technologies to collect and analyze billions of records, Verisk draws on unique data assets and deep domain expertise to provide first-to-market innovations integrated into customer workflows. We’ve been delivering predictive analytics and decision support solutions to our customers for nearly 50 years, helping them protect people, property, and financial assets. At Verisk, you’ll be part of an organization that’s committed to serving the long-term interests of our stakeholders, including the communities where we operate.\n\nAt Verisk, you can build an exciting career with meaningful work; create a positive and lasting impact on the business; and find the support, coaching, and training you need to advance your career. Our culture of innovation means your ideas on how to improve our business will be heard. As key contributors to our success, our team members enjoy working in a business-casual, collaborative environment that offers state-of-the-art resources, advanced technologies, and an excellent benefits package.\n\nJob Description\n\nJob Description\n\nWe are looking for someone who has a strong web development or computer science background to join a world-class team building the next generation of Xactware’s online claims platform. You will work closely with a cross-functional team of developers, QA analysts, product managers, and designers to build a sophisticated web application. Our team employs a modern technology stack including Angular (6.x), TypeScript, Sass, HTML, ASP.NET Core, and C#. If you know or want to learn these technologies, we’d love to talk with you, so please apply. \n\nTeam Culture & Benefits\n\n· Managers who listen to their employees\n\n· A mindset of continuous improvement. We always want to be getting better.\n\n· 30 minutes a day of personal study time\n\n· On-site gym\n\n· Flexible hours\n\n· Competitive PTO plus 9 holidays a year\n\n· Performance-based yearly bonuses\n\n· A great view of Utah Valley\n\nEssential Functions\n\n· Create cutting-edge software using modern development tools\n\n· Solve non-trivial technical challenges\n\n· Work as a member of a team\n\n· Write unit, integration, and functional tests\n\n· Implement new features and fix bugs\n\n· Contribute to product design\n\nQualifications\n\n· Minimum of Bachelor's degree in computer science (or related field)\n\n· Strong HTML, CSS, and JavaScript skills\n\n· Proficiency with Angular, AngularJS, React, Ember.js or another JavaScript front-end framework\n\n· Proficiency with ASP.NET Core or another modern back-end framework\n\n· Experience with the Git or another version control system\n\n· Familiarity with TypeScript and Sass a plus\n\n· Will write clean, maintainable code\n\n· Ability to communicate effectively and professionally with others\n\n \n\n \n\n \n\n#LI-TL22\n\nQualifications\nAdditional Information\n\nVerisk Analytics is an equal opportunity employer.\n\nAll members of the Verisk Analytics family of companies are equal opportunity employers. We consider all qualified applicants for employment without regard to race, religion, color, national origin, citizenship, sex, gender identity and/or expression, sexual orientation, veteran's status, age or disability.\n\nhttp://www.verisk.com/careers.html\n\nUnsolicited resumes sent to Verisk, including unsolicited resumes sent to a Verisk business mailing address, fax machine or email address, or directly to Verisk employees, will be considered Verisk property. Verisk will NOT pay a fee for any placement resulting from the receipt of an unsolicited resume.\n\nApply now",
    "location": "Lehi, UT",
    "employer": "Xactware"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=504&ao=182759&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_d0800278&cb=1560102279114&jobListingId=3252717647",
    "title": "Front-End Software Developer",
    "description": "SunIRef:it\n\nFront-End Software Developer\n\nAsurion\n\n2,135 reviews\nSan Mateo, CA 94402\nAsurion\n\n2,135 reviews\n\nRead what people are saying about working here.\n\nFront-End Software Developer-PRO01332\n\nDescription\n\nFront-End Software Developer\n\nThe Software Engineer 2 is functionally competent and working toward functional expertise in the field of software engineering as it relates to the business objectives of Asurion. The Software Engineer 2 will design, code, test, and debug applications that meets system standards and functional requirements in various software languages. The position will assist in code reviews and with the activities for approved Projects, system improvements, and ad-hoc or emergency requests.\n\nKey Responsibilities/Essential Functions\n\nDevelops effective, maintainable code in a timely fashion\nFollows established coding standards and techniques, assists with establishing standards\nDevelops automated unit test cases to validate defect-free code\nConducts code reviews with peers and management\nWorks with QA team to ensure quality code that meets the functional requirements\nMaintains proficiency in the application and use of systems, tools, and processes within the department's scope\nMaintains proficiency in the business processes that drive the applications within the department's scope\nMaintains a working knowledge of Asurion's applications and system integration\nAssists with the compilation of status notifications for business stakeholders and Client Relations\nEnsures code compiles with security policies and guidelines\nWork closely with Product and UX team as part of Journey Team, perform product discovery, user testing, prototyping and designing/implementing final solutions.\n\nQualifications:\n\nBS in Computer Science, Engineering, Mathematics or a related field required\n2 years' experience in software development\n1 year of software development experience required in one or more of the following: JavaScript, Node.js or Java\nExperience developing Web applications\nSpecific knowledge/experience in most of the following preferred:\nExperience in two or more of the following areas: RESTful web services, React.js, React-Native, Python, AJAX, Strong Javascript/Angular programming skills, Cloud Architecture & Services, Java, Data analytics and user experience.\n\nSpecific knowledge/experience in most of the following preferred:\n\nWeb System Architecture, SOA, REST, AJAX, JSON, CDN, SSO, WebPack, browser SFIY\nJavaScript/jQuery, HTML5/CSS3, MVVM, Backbone, React.js, Angular, Bootstrap\nExperience with Python and/or Node.js preferred\nWorking knowledge with CSS3 and HTML5\nExperience with developing single-page, responsive web & mobile application\nWeb standards, cross-browser compatibility, and web-related performance and optimization techniques.\nGood OOD / OOP knowledge\nGood diagnostic, analytical, design and communication skills\n\n#LI-JW1\n\nJob:Product Development\n\nPrimary LocationUS-CA-San Mateo - Fashion Island\n\nOrganization Product Development\n\nSchedule Full-time\n\nJob Posting\n\nUnposting Date\n\nAsurion - 20 hours ago - report job - original job\n\nOn Company Site",
    "location": "San Mateo, CA",
    "employer": "Asurion"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=511&ao=4120&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_818bd689&cb=1560102279120&jobListingId=3149219896",
    "title": "Home / Software Developer",
    "description": "United States\nFull-time\n\nLynker Technologies on contract to NOAA’s Office for Coastal Management (OCM) is looking for a Application Developer with the following skill sets.\n\nIn This Position You Will\nInteract with project teams to understand requirements and translate them into innovative solutions\nWork closely with a team of talented developers to design, develop, test, deploy, and support web-based applications, following an industry standard product development process in cutting-edge technologies\nParticipate in research, planning, and brainstorming with development and project teams\nParticipate as a member of a technical team that proactively plans the implementation of enterprise systems across a wide platform of technologies\nSkills and Requirements\nLocated in Charleston, South Carolina or able to relocate\nSolid experience with JavaScript, HTML5, CSS3, and demonstrable experience working with heavy front-end web applications\nExperience using RESTful JSON web services\nExperience with frameworks such as Angular, React, Vue.js or jQuery\nProficient with tools like Grunt, Gulp, Yeoman, Bower, Karma, Webpack,Parcel.js\nExperience with Jasmine/Mocha, LESS/SASS is a plus\nBachelor’s degree in computer science or related field and five-plus years of experience in software development or Master’s degree in computer science and three-plus years of experience\nYou will be expected to complete an on-site and/or take home assignment for this position.\nNice to Have, But Not Required\nKnowledge of Continuous Integration systems like Bamboo/Jenkins\nKnowledge of cloud solutions and services such as Azure and AWS\nExperience with Node.js and related frameworks like Express, Socket.io, Sails.js\nFamiliarity with the concept of using an ORM (object relational mapping) library for data intensive applications (e.g., Sequelize for Node.js)\nWeb Mapping Frameworks like OpenLayers, ArcGIS API for JavaScript or Leaflet\nVisualization frameworks like D3, Highcharts\nExperience with static site generators like Middleman, Jekyll or Hugo\nKnowledge of scripting languages like Ruby or Python\nA great portfolio that demonstrates web development skills\nOpenSource contributions and StackOverflow reputation is a plus\nView Examples of Recently Developed Applications\nAdapting Stormwater Management for Coastal Floodshttps://coast.noaa.gov/digitalcoast/training/stormwater-floods.html\nSea Level Rise Viewer\nhttps://coast.noaa.gov/digitalcoast/tools/slr.html\nCoastal Flood Exposure Mapper\nhttps://coast.noaa.gov/digitalcoast/tools/flood-exposure.html\nHistorical Hurricane Tracks\nhttps://coast.noaa.gov/digitalcoast/tools/hurricanes.html\nData Access Viewer\nhttps://coast.noaa.gov/dataviewer/#/\n\nAbout Lynker\n\nLynker Technologies, LLC is a growing, Hub-zone certified small business specializing in professional, scientific and technical services with offices in Leesburg, VA and Boulder, CO. Our continually expanding team combines scientific expertise with mature, results-driven processes and tools to achieve technically sound, cost effective solutions in hydrology/water sciences, geospatial analysis, information technology, resource management, conservation, and management and business process improvement.\n\nWe focus on putting the right people in the right place to be effective. And having the right people is critical for success. Our streamlined organization enables and empowers our talented professionals to tackle our customers’ scientific and technical priorities – creatively and effectively.\n\nLynker offers a team-oriented work environment, competitive salaries and benefits, and the opportunity to work in a culture of exceptionally skilled and diverse professionals who embrace sound science and creative solutions.\n\nLynker Technologies is proud to be an Equal Opportunity Employer and encourages women, minorities, individuals with disabilities and veterans to apply.\n\nApply with Indeed\n\nGo to all jobs",
    "location": "United States",
    "employer": "Lynker Technologies"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=514&ao=25073&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_41484148&cb=1560102279123&jobListingId=3256266903",
    "title": "Junior Software Developer (Node.js)",
    "description": "Junior Software Developer (Node.js)\n\nMidtown of Atlanta, GA\n\nContract to hire\n\nOur Fortune 100 Digital Media client is looking for a Jr Software Developer with at least 6 months of Node.js development experience to join an exciting development team that is building a new live sports video streaming service. As a Junior Developer, you will be on a team that practices Agile with a startup mentality and works with the latest leading-edge technologies and cloud-based platforms. You will work on projects including developing and scaling APIs, cloud automation, eCommerce, streaming video, and live scoring - all within rigorous scale, availability, and ISO standards. You will have the opportunity to work primarily in the MEAN stack (MongoDB, Express, Angular, Node.js) on AWS.\n\nResponsibilities:\nFull stack web development in MEAN (MongoDB, Express, Angular, Node.js) and MERN (MongoDB, Express, React, Node.js)\nDevelop and leverage RESTful APIs\nWork with web services and standards (i.e. AJAX, JWT, JSON, local storage)\nLeverage solutions from across the JavaScript ecosystem (Typescript, Webpack, NPM, Babel)\nWeb performance optimization with a constant eye towards reliability, scale, and performance\nCollaborate with cross-functional teams and play a part in the Agile process for planning, estimating, and execution\nBrainstorm creative solutions to business requirements\nCode in accordance with industry best practices and participate in the code review process, mentoring other developers and documentation\nDeliver bug free and efficient code and write unit tests against logic\nQualifications:\nAt least 6 months of Node.js development experience on a professional level\nHigh aptitude to quickly learn\nAbility to develop at the enterprise-level\nEight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws.",
    "location": "Atlanta, GA",
    "employer": "Brooksource"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=516&ao=359521&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_38e2b891&cb=1560102279125&jobListingId=3260352494",
    "title": "Software Developer (AngularJS, C#.NET,)",
    "description": "Job Summary This role is withing the Quickhits group (Rapid Access Group) Projects are mostly small to medium size and have shorter timelines and processes are streamlined Team builds dashboard applications for the clinical trials group and this person is needed because there is an increase in requests to add tools and for tweaks. Must have the following experience AngularJS C.NET Oracle Preferred expereince, but not required NodeJS and React Regards, Vandy Gupta Advantech Solutions P-847-978-6330 vandyatsus.net mailtovandyatsus.net",
    "location": "North Chicago, IL",
    "employer": "Advantech Solutions, Inc."
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=519&ao=3839&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_b5560729&cb=1560102279128&jobListingId=2545352597",
    "title": "Software Developer - Simon Initiative",
    "description": "Carnegie Mellon University’s Simon Initiative accelerates the success of the university’s educational-technology ecosystem. Central to this work is an approach called Learning Engineering: the use of learning research and the affordances of technology to design and deliver innovative, instrumented educational practices. These innovations improve outcomes while simultaneously generating data to refine and advance theory, fueling a virtuous cycle of research and practice. The Initiative encompasses a broad array of faculty, researchers, technologists, expertise centers/organizations, and associated projects, expertise services, technologies, innovations, and research.\n\nWe are seeking a front-end software engineer to develop, extend, and scale our web-based learning environment. This is an excellent opportunity if you thrive in an interesting and challenging work environment. The Open Learning Initiative builds rich, interactive, and effective online courses for use in higher education. Join our team and build creative new applications for course authoring, content management, workflow automation, assessment and learning analytics.\n\nCore responsibilities will include:\nDesign, implement, test and maintain the OLI web-based learning environment. Build scalable solutions using current generation web technologies. Track issues and tasks using bug tracking and project management software. Perform detailed quality assurance testing of all work products. Provide targeted contributions to back-end development as needed.\nAnalyze feature requests to determine feasibility and system compatibility. Collaborate with software engineers, learning scientists, course developers, domain experts, visual designers and usability specialists to define software requirements.\nSupport user issues related to the system or application performance and availability. Troubleshoot and resolve problems; communicate resolutions to help desk team.\nMay need to be on-call during off hours and respond to Tier 2 support issues or system outages.\nYou should have a team-oriented approach. Adaptability, excellence, and passion are vital qualities within The Simon Initiative. Inclusion, collaboration and cultural sensitivity are valued competencies at CMU. Therefore, we are in search of a team member who is able to effectively interact with a varied population of internal and external partners with a high level of integrity. We are looking for someone who shares our values and who will support the mission of the university through their work.\n\n**Please note this is a fixed term position, dependent on funding and anticipated to last through summer of 2018.\n\nQualifications:\nBachelor’s degree in Computer Science, Information Systems, or related area required; Master’s degree preferred\nOne or more years of industry experience building web applications using a modern technology stack, particularly React TypeScript\nAdditional Skills and Experience:\nStrong working knowledge of JavaScript, including fluency in modern language features and third-party type solutions.\nExperience applying functional programming techniques to write high-quality, efficient, maintainable code.\nExpertise in building web based user interfaces in HTML and CSS.\nFamiliarity with using Git and GitHub to develop open source software.\nExperience in, or desire to learn, Elm.\nExperience participating in and facilitating Agile software development.\nExperience delivering web applications to tablets, smartphones and other mobile devices.\nMore Information:\n\nPlease visit “Why Carnegie Mellon” to learn more about becoming part of an institution inspiring innovations that change the world.\n\nA listing of employee benefits is available at: www.cmu.edu/jobs/benefits-at-a-glance/.\n\nCarnegie Mellon University is an Equal Opportunity Employer/Disability/Veteran.",
    "location": "Pittsburgh, PA",
    "employer": "Carnegie Mellon University"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=520&ao=23480&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_9642ca9c&cb=1560102279129&jobListingId=3254099834",
    "title": "IT - Software Developer",
    "description": "Below is an overview of the job duties, to view the full job description click the link listed at the bottom of the position.\n\nResponsibilities:\nBuild high-performing, scalable, enterprise-grade applications working on all levels of applications, from front-end interfaces to supporting micro-services.\nAssist with maintaining existing applications and designing new application features.\nWrite new application code using best practices.\nAssist in improving the automated build systems.\nAssist with maintaining and improving continuous-integration (CI) environments.\nEnsure designs are in compliance with specifications and meet security standards.\nPrepare and produce releases of software components.\nDemonstrate a proactive understanding of best practices and design patterns.\nUse applicable industry-specific tools such as code repositories and integrated development environments (IDEs) to enhance productivity.\nStay in tune with emerging technologies and industry trends and apply them when applicable.\nRequirements:\nBachelor's degree from four-year college or university preferably in Computer Science; and one to two years related experience and/or training; or equivalent combination of education and experience.\nKnowledge of development software, databases, web or iSeries systems, API integrations, word processing software, spreadsheet software, and RPG or technologies utilized in e-commerce and on the web such as: Java, C#, HTML, CSS, Javascript, Xamarin, Swift, XAML, Thymeleaf, SQL, Spring, SpringBoot, React, Angular, Tomcat, and web services.\nFull -Time Position: Monday Friday\n\nTo view full job description click here\n\nBuckle is an Equal Opportunity Employer dedicated to promoting a diverse workforce.",
    "location": "Kearney, NE",
    "employer": "The Buckle"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=525&ao=14295&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_94aeaefe&cb=1560102279134&jobListingId=2348405580",
    "title": "Full-Stack Software Developer",
    "description": "As we build and scale Crystal over the next few years, our product & engineering group is growing along with it. We're building the largest, most accurate personality platform in the world - it's a huge project that requires close collaboration between data analysis, NLP, and social science.\n\nWe're looking for a full-stack software engineer to join our team, taking the lead on projects across our platform (web dashboards, integrations, machine learning, etc). We value:\nTrue individual ownership and responsibility over projects.\nSaying “no” to lots of good things to say “yes” to one great thing.\nListening to constant feedback from our team and customers.\nHaving a healthy approach to product velocity and technical debt.\nTaking our work very seriously, but not taking ourselves too seriously.\nYou'll be working alongside a talented product team to translate Crystal's powerful data into everyday business value, and you'll be on the ground floor helping us build the foundation for an enduring, impactful company.\n\nNow for some specifics:\nYour day-to-day will vary between different components of our product, so this role requires technical flexibility and a desire to learn new skills quickly. We work primarily with Javascript (React, jQuery), Ruby on Rails, and MySQL. Our platform runs on AWS with services like Elastic Container Service, EC2, RDS, and others.\nWe have a lot on our roadmap for the next three years, including improvements to the breadth and accuracy of our personality detection system, Chrome extensions, enterprise tools, and data integrations.\nWe rely on a few tools very heavily for communication and workflow - Slack, Github, Trello, Google Apps.\nWe love customer support and believe everyone plays a part in user experience.\nRequirements\n\nQualifications:\nSincere appreciation for good communication and healthy work relationships.\nExperience with JavaScript frameworks such as Node.JS and React.JS\nExperienced with Ruby, Python, Golang or other programming language\nTest Driven Development\nExperience with Postgres or other SQL databases in a production environment\nWriting REST APIs on the back-end, and consuming them on the front-end.\nExperience building and maintaining large, complex software products at scale (either consumer or enterprise).\nAbility to explain technical concepts to a group clearly and concisely\nNice to have:\nExperience with architecting cloud-based deployment strategies and CI workflow, and deployment pipelines\nExpertise in AWS, micro-services / server-less architectures, and big data applications\nPrior experience with EC2, ECS, and S3 on AWS is beneficial\nThings we'd love to see:\nOne or two products/projects you've developed that you're really proud to show.\nExperience with Chrome extensions or other browser integrations.\nBenefits\n\nWhile we are an early stage company and don’t have the same kinds of lavish perks of a larger tech company, we do offer full medical, dental, and vision coverage for you and your family, flexible hours and a remote-first culture where you’re truly measured on your impact instead of your time.",
    "location": "Nashville, TN",
    "employer": "Crystal"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=526&ao=170712&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_fa241c75&cb=1560102279135&jobListingId=3191411775",
    "title": "3M HIS Software Developer (Meriden, CT)",
    "description": "At 3M, we apply science in collaborative ways to improve lives. With $33 billion in sales, our 93,000 employees connect with customers all around the world.\n\n3M has a long-standing reputation as a company committed to innovation. We provide the freedom to explore and encourage curiosity and creativity. We gain new insight from diverse thinking, and take risks on new ideas.\n\nHere, you can apply your talent in bold ways that matter.\n\nJob Description:\n\n3M is seeking a Software Developer for the 3M Health Information Systems located in Meriden, CT. At 3M, you can apply your talent in bold ways that matter. Here, you go.\n\n3M Health Information Systems (HIS) is the world leader for innovating the language of health and delivers comprehensive software and consulting services. Working at 3M Health Information Systems you will be helping with today’s challenges, while preparing for tomorrow’s. Transforming health care from a system that treats disease, to a system that improves health and wellness begins with accurate health information and payment. From improving efficiency of medical records coding, to outlining success in value-based care and health care analytics. All while working with the best and the brightest to advance more than your own career, you are working to advance the entire world.\n\nSoftware Developer Job Summary:\n\n3M HIS is seeking a Software Engineer who is highly motivated to help us pioneer the future of Health Care Information Technology. We work with government agencies, insurance companies, provider networks and health care business partners to deliver software products that directly impact the future of health spending and patient care. Our cross-functional agile teams develop a mix of AWS cloud-based and on-premises applications - interest and versatility in both areas is a must. If you are a software developer that would like to be part of a fast-paced, forward-moving team, with a passion for solving difficult problems that have a direct impact on the quality of health care globally, we want you.\n\nThis position provides an opportunity to transition from other private, public, government or military environments to a 3M career.\n\nPrimary Responsibilities (Software Developer) include but are not limited to the following:\nParticipate in and/or lead technical brainstorming sessions to formulate designs that minimize maintenance, maximize code reuse and minimize testing time\nDevelop code according to business and technical requirements, create test data, perform unit/integration tests and collaborate with team to deliver high quality products\nPerformance and stress testing of assigned functionality to ensure client expectations are met for optimal software latency and resource utilization\nDrive continuous improvement in processes and software, valuing automated unit tests, peer code reviews and Continuous Integration/Continuous Delivery\nParticipate in and/or lead client product/feature demonstrations\nBasic Qualifications (Software Developer):\nBachelor’s Degree or higher from an accredited university OR High School Diploma/GED or higher from an accredited institution and a minimum of six (6) years of experience in software engineering in lieu of the Bachelor’s degree education requirement\nMinimum of two (2) years of object-oriented software development experience (can include internship and course work) in a private, public, government or military environment\nPreferred Qualifications (Software Developer):\nExperience with Java software development\nProficient with at least one IDE (Eclipse, Netbeans, InteliJ) doing activities such as debugging, code completion, searching, etc\nExperience with Web services (SOAP/REST)\nExperience with JavaScript frameworks such as Angular, React JS,\nExperience with Linux shell scripting\nExperience using git and/or Team Foundation Server (TFS)\nExperience with Gradle, Ant, or Maven\nExperience with Amazon Web Services (AWS)\nFamiliar with SQL and relational database design\nKnowledge of Agile methodology and experience working with distributed team members\nExcellent verbal and written communication skills\nAbility to solve problems in a logical, methodical, and time efficient manner\nPotential to direct and influence others\nLocation: Meriden, CT\n\nTravel: May include up to 10% domestic\n\nRelocation: Is not authorized.\n\nDiverse & Inclusive 3M\n\n3M is a place where you can collaborate with other curious, creative people. Where your diverse talents, inclusiveness, initiative, and leadership are valued. Where you’ll find challenging opportunities that make your career exciting and rewarding. With a diversity of people, global locations, technologies, and products, 3M is a place to grow and be rewarded for excellence.\n\nLearn more about 3M’s creative solutions to the world’s problems at www.3M.com or on Twitter @3M.3M is an equal opportunity employer. 3M will not discriminate against any applicant for employment on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status.\n\nPlease note: your application may not be considered if you do not provide your education and work history, either by: 1) uploading a resume, or 2) entering the information into the application fields directly.\n\n3M Global Terms of Use and Privacy Statement\n\nCarefully read these Terms of Use before using this website. Your access to and use of this website and application for a job at 3M are conditioned on your acceptance and compliance with these terms.\n\nPlease access the linked document by clicking here, select the country where you are applying for employment, and review. Before submitting your application you will be asked to confirm your agreement with the terms.",
    "location": "Meriden, CT",
    "employer": "3M"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=528&ao=4120&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_364938b3&cb=1560102279137&jobListingId=3115151169",
    "title": "Software Developer (Cloud)",
    "description": "Do you enjoy building elegant, useful services, APIs, and front-end systems for large, successful, and demanding customers?\n\nDo you have a passion for continuous integration (CI) and delivery (CD), and deploying and operating your own code in the cloud?\n\nDo you have an eye for detail and best practices in scalability, security, and coding?\n\nWe are an early stage, fast-growing cybersecurity solutions company delivering higher trust identity assurance to Fortune 1000 companies and we want you to be a part of our team. The demand for our Axiad ID Cloud solution is doubling year over year, and we are looking for an experienced Software Developer to be actively involved in the design, development, and operations of our unique, highly secure, and scalable Cloud Identity and Access Management platform. This is a fantastic opportunity to engage in a positive and creative work environment that offers competitive compensation and excellent benefits (stock options, 401K and health insurance).\n\nEssential Duties and Responsibilities:\nContribute in all phases of the development lifecycle (design, unit tests, implementation, end to end test automation, cloud deployment, and DevOps)\nContribute to improvement of every aspect of our cloud services platform\nContribute to improvement of every aspect of our continuous integration pipeline\nRequired Knowledge and Work Experience:\nProduct experience developing one or both of the following:\n\n- Back-end: Experience developing multi-threaded services in a mainstream language (e.g. Java, JavaScript, C#)\n\n- Front-end: Experience developing UI’s on a modern framework (e.g. Angular, React, etc.)\nFamiliarity with a major IDE, git, test driven development, commonly used open source components\nAbility to take general architectural direction, contribute feedback and enhancements, and define a design approach for the component/service\nKnowledge of open source server-side or client-side tech stacks\nUnderstanding the concepts used to deploy a cloud application is a plus\nAwareness of cloud platform concepts (e.g. Amazon Web Services technologies such as EC2, RDS, S3, CloudFormation, ELB/ASG)\nDevelopment experience in one or more primary programming languages\nUnderstanding of protocols/technologies like HTTP, SSL/TLS\nA passion for building scalable and reliable cloud services\nBackend/service Java, JavaScript, or C# product development experience\nEnergetic and passionate about being successful and open to different technologies\nClear written and verbal communications skills\nProven team player\nAttention to detail, self-motivated, creative and flexible\nA good problem solver with the ability to brainstorm, troubleshoot, identify key issues, and find solutions\nBS Degree in Computer Science or equivalent experience in implementing, and deploying relevant projects\nEligible to work in the US without sponsorship.\nBONUS EXPERIENCE\nProfessional work experience with online and cloud services\nLinux administration experience (e.g. RedHat/CentOS) with a focus on web (Apache/Nginx/HAProxy/Tomcat), Java application and databases (e.g. Oracle, PostgreSQL, MySQL, NoSQL).\nAWS/Google Cloud/Azure\nAdditional programming languages\nSAML, OAuth single sign-on\nPKI concepts, basic cryptography or related libraries\nMobile development\nSend your resume to careers@axiadids.com",
    "location": "United States",
    "employer": "Axiad IDS"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=529&ao=8095&s=58&guid=0000016b3d579522b89ed9af17d29309&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&ea=1&cs=1_d52553be&cb=1560102279138&jobListingId=3229788035",
    "title": "iOS/Android Software Developer",
    "description": "Fearless is looking for an iOS/Android Software Engineer to add to our diverse team of over 75 teammates (and counting!).\n\n \n\nWhat you'll be doing:\n\nWe're looking to change the world by building software with a soul, and we want your help. On this project, you will be working with 5-7 Fearless team members on a project for one of our existing clients. You will report to the team's Scrum Master, but you will collaborate closely with all members of your Scrum team.\n\n \n\nWhat you should know:\nThis position is located in our headquarters in Baltimore, MD. This position also has the flexibility to support some remote work / telecommuting.\nTravel may be required 1-2 times per month.\nWhy we're excited about you:\n\nWe need your mobile development skills! Languages used on this project will include React Native, Android, and iOS.\nWhat other skills will help you succeed at Fearless? Glad you asked! We're excited about candidates who:\nUnderstand development principles, at least one technology stack, and software development tools and processes\nAre proficient in troubleshooting and bug fixing\nConsistently follows best practices and are able to write correct and clean code without guidance\nWork well in a team and know when to ask for help\nCan communicate basic technical ideas and concepts to non-technical team members\n \n\nAt Fearless, we believe in sharing knowledge, fresh perspectives, and unique interests as individuals and as a company, so we're also interested to know what makes you tick. We want to know where your interests and passions lie so we can all grow together.\n\n \n\nCompensation:\n\nWe believe in paying people fairly, so we've established a compensation model that ensures everyone at Fearless — regardless of race, ethnicity, gender, sexual orientation, disability, religion, age, nationality, or negotiation skills — is given equal pay for equal work.\n\n \n\nSo, what's next?\n\nOver the years, we've honed a 3-step interview process that helps ensure that every employee we hire is the right fit for us and that we're the right fit for them. If we think you're a good fit, we'll get in touch and start scheduling your interviews!\nCultural Interview - We're a people-first company, so we always start off by getting to know more about you, how you work, what your career goals are, and what you're passionate about. This is your opportunity to ask questions and get a feel for Fearless, so don't be shy!\nTechnical Interview - This is where we get into the nitty gritty of the project. During the Technical Interview, you'll be interviewed by our Passion Coaches and/or the team's Project Lead to make sure your skills align with the project requirements.\nBusiness Interview - At this point, you've made it to the final frontier! The Business Interview is when you'll meet with Fearless leadership to dot the i's, cross the t's, and determine whether or not we'll be moving forward with the hiring process.\n \n\nWhy Fearless?\n\nOur people make us who we are. We believe that every member of the Fearless team has something to share, and we value the unique viewpoint you'll bring to our community. But we value your community, too, so we offer fulfilling work that stays in balance with the rest of life. Because everyone has different needs, desires, and goals, our benefits offer the choices and flexibility that our team members need to live well and succeed. Here are a few highlights of our benefits package:\n\n \nFlexible schedule\nFamily-friendly workplace\n3 weeks accrued PTO + 1 week sick leave + 10 federal holidays + your birthday off\n100% coverage of the employee-only premium for HSA, HMO, or PPO plan and Employee Wellness Plan\nTech, education / training, and snack allowances\nFree parking in downtown Baltimore / public transit coverage\nSafe Harbor 401(k) plan with employer contributions\n \n\nAbout Fearless:\n\nFearless is a full-stack digital services firm in Baltimore that delivers sleek, modern, and user-friendly software designed to push the boundaries of possibility. It's our mission to build software with a soul — tools that empower communities and make a difference — so we can create a world where good software powers the things that matter.",
    "location": "Baltimore, MD",
    "employer": "Fearless"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=802&ao=137292&s=58&guid=0000016b3d58d1198501e0898439f014&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_57e581cd&cb=1560102359775&jobListingId=3259795178",
    "title": "Software Developer – BI Digital Customer Portfolio",
    "description": "Company Information\nSolid reputation, passionate people and endless opportunities. That's Travelers. Our superior financial strength and consistent record of strong operating returns mean security for our customers - and opportunities for our employees. You will find Travelers to be full of energy and a workplace in which you truly can make a difference.\n\nJob Summary\nTravelers BI Digital Customer portfolio has an exceptional development opportunity as a part of our initiatives to transform the user experiences of our Agents, Customers and Employees through solutions that are flexible, convenient and competitive.\n\nThis Software Developer will actively collaborate with agile teams on the thoughtful design, development and delivery of valuable Digital capabilities. This person will perform front-end UI and Microservices level design and development as well as the development of server-side components to satisfy the needs of our Digital Insured today and tomorrow. In collaboration across our Enterprise technology organizations, our Digital initiatives will employ advanced technologies and methodologies to deliver critical business functionality incrementally, while adhering to architectural principles of reuse and multi-device deployment. Proof of concept and innovation sprints leveraging disruptive technologies like cognitive and IoT are also part of this role.\n\nPlease contact us if you:\nEnjoy solving problems and finding innovative ways to deliver business value with technology\nWant to work in a diverse and talented agile team\nHave experience creating value in technologies like the following:\nJava, Spring Core / Spring Boot / Spring Cloud or transferrable skills from similar technologies such as .NET\nJavaScript, Node.js or transferrable skills from similar technologies\nReact, Angular or another Front-end framework\nPrimary Job Duties & Responsibilities\nTransform business specifications and requirements into meaningful and organized technical activities\nPerform complex analysis, assessment, resolution, design, configuration and programming functions of components leveraging appropriate technologies to deliver robust solutions that address business needs\nDevelopment of server-side components to satisfy front-end requirements\nPractice test driven development, refactoring, and continuous integration as a part of an agile development team\nAdopt and communicate new concepts, ideas, techniques and best practices\nWork closely with UX designers, business partners, business analysts and software architects to deliver highly usable software that satisfies business needs\nConvert wireframes into workable prototypes for business review, design validation and usability testing\nWork closely with development team and architects to suggest, plan and implement the best solution with the user experience in mind\nDevelop reusable artifacts that may include HTML, CSS, JavaScript, Angular, React and/or other technologies\nLearn and leverage disruptive technologies like cognitive AI/machine learning and IoT during innovation sprints to solve business problems\nParticipate in all Agile ceremonies such as stand-ups, release planning, retrospectives, and customer demos\nBuild, maintain, and utilize partnerships across the enterprise\nEnsure work complies with Travelers standards, processes, and protocolsOther duties as assigned\nMinimum Qualifications\nA bachelor's degree in Computer Science or a related field, or its equivalent in work experience, and five years of programming/development experience.\n\nEducation, Work Experience & Knowledge\n3+ years development experience in one of the following:\nJava, Spring Core / Spring Boot / Spring Cloud or transferrable skills from similar technologies such as .NET\nJavaScript, Node.js or transferrable skills from similar technologies\nFront-end UI framework React, Angular, or transferrable skills from similar technologies\nStrong technical design and programming skills\nCloud application development experience a plus\nMicroservice development experience, building RESTful APIs is a plus\nSolid understanding of UI front-end development including HTML, CSS and JavaScript\nNoSQL development experience such as MongoDB\nElastic search engine such as SOLR is a nice to have\nPrior experience with iterative development and agile practices is a plus\nJob Specific & Technical Skills & Competencies\nAbility to adopt new concepts, ideas, techniques and best practices\nExcellent analysis and problem-solving skills\nAbility to communicate clearly and effectively with peers, partners and customers\nAbility to develop and present technical concepts to a business audience\nAptitude and desire to rapidly learn technical and business concepts and disciplines\nStrong commitment to high quality work and timely deliverables\nInclusive team-oriented approach. Exhibits objectivity and openness to others' views. Gives and welcomes feedback. Puts success of the team above own interests\nAble to assess the financial impact of recommended designs/solutions\nEnvironmental/Work Schedules/Other\nWork Location: Hartford, CT or Saint Paul, MN\nInfrequent weekend work hours.\nInfrequent overnight work hours.\nInfrequent holiday work hours (Federal and religious).\nMay require travel.\nPhysical Requirements\nOperates standard office equipment. Requires extended periods of computer use. Requires extended periods of sitting.\n\nLicensing or Certificates\nDepends on the specific role but some examples may include: ITIL Remedy Java certification Microsoft certification.net Kanban/Agile/SAFe\n\nEqual Employment Opportunity Statement\nTravelers is an equal opportunity employer.",
    "location": "Saint Paul, MN",
    "employer": "Travelers"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=1001&ao=447365&s=58&guid=0000016b3d5ae0b8927b8ee1fb6c61b4&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_5a5845f7&cb=1560102494909&jobListingId=3257334190",
    "title": "Mid-Level Full-Stack Software Developer",
    "description": "Bethesda, MD\n\nRightEye is an exciting, and cutting-edge eye-tracking solutions company and we are looking for qualified candidates for a Mid-Level Full-Stack Software Developer position. The candidate will work with a great team of experts and passionate people. We are looking for an engineer with strong communication skills who is a team player focused on elevating their performance and that of those around them.\n\nResponsibilities Include\n\nWork effectively as part of the engineering team to develop production quality code\nFull stack application development\nPerform detailed technical design and implementation of features\nActively participate in all aspects of the development methodology and software development lifecycle\nPerform code reviews\nMentor others in both coding and software engineering skills\nCommunicate with technical lead and other team members in order to meet requirements\nContribute to development process/methodology\nEffectively manage time and work while reporting status as necessary\nMust Have Skills\n\n2+ years of recent Java experience in a professional environment\nExperience using Hibernate or another ORM technology\nExperience with the Spring ecosystem\nFamiliarity and comfort working on Frontend Html, Javascript and CSS\nFamiliarity and practical experience with React, Vue, Angular, JQuery or other javascript frameworks and libraries.\nExperience with Maven or Gradle\nOther Desired Skills\n\n2+ years of recent Java experience in a professional environment\nExperience using Hibernate or another ORM technology\nExperience with the Spring ecosystem\nExperience with Spring Boot and Spring Security\nFamiliarity and comfort working on Frontend Html, Javascript and CSS\nFamiliarity and practical experience with React, Vue, Angular, JQuery or other javascript frameworks and libraries.\nExperience with Maven or Gradle\nSoftware development for AWS cloud native applications\nExperience building deploying and managing applications in AWS\nExperience working with relational databases and preferably some No SLQ database.\nStrong understanding of development patterns such as REST and microservices pattern\nFamiliarity with Docker and containerization\nExperience with systems that utilize machine learning\nKnowledge and/or experience with HIPAA / PHI requirements\nWhy RightEye?\n\nWork in an industry segment that is seeing lots of growth\nExciting quick moving company with lots of industry buzz\nEntrepreneurial environment that is opportunity and customer driven\nSmall team work environment\nAbout RightEye\n\nRightEye is the maker of a breakthrough, FDA-cleared eye-tracking technology for general healthcare. This SaaS-based system is proven to uncover vision and brain health issues in minutes. RightEye just surpassed 100,000 patient tests and has a quickly growing customer base. Our product is already used by hundreds of optometrists, medical facilities and professional sports teams (including the Washington Capitals, Nationals and Redskins). RightEye is also a strategic partner with the largest eye-care health company in the United States, with a network of 30,000+ optometrists.\n\nRightEye is gearing up for even faster customer growth. This is your chance to get on the ground floor of one of the regions most cutting-edge and fast-growing B2B technology companies. Recently, RightEye won a coveted Innovations Award at the Consumer Electronics Show (CES) and was named Emerging Tech Company of the Year by the Maryland Tech Council.",
    "location": "Bethesda, MD",
    "employer": "RightEye"
  },
  {
    "href": "https://www.glassdoor.com/partner/jobListing.htm?pos=1028&ao=25074&s=58&guid=0000016b3d5ae0b8927b8ee1fb6c61b4&src=GD_JOB_AD&t=SR&extid=1&exst=E&ist=L&ast=EL&vt=w&slr=true&cs=1_c105dd39&cb=1560102494935&jobListingId=3259695227",
    "title": "ANALYST - SOFTWARE DEVELOPMENT",
    "description": "Job Summary:\nJoin our Space Science engineering team! Collaborate with a small team of developers to help design and implement overall architecture of web applications, maintain quality and ensure responsiveness of applications as well as code integrity and organization, aid in implementing security and data protection, and oversee scientific programming for space related data.\n\nEducation/Experience:\nRequires a BS degree in Computer Science, Computer Engineering, Software Engineering with 0-1 year of experience. Must have at least a 3.0 GPA. Must be a skilled full stack web developer who is comfortable with both front and back end programming, developing and designing front end web architecture, ensuring the responsiveness of applications and working alongside scientists and engineers for web design features, among other duties. Must have experience with Linux, PHP, HTML, CSS, Python, Javascript, and jQuery. Prefer familiarity with back-end libraries such as CakePHP, experience with front-end class libraries such as Bootstrap, AngularJS, PlotLy, React. Prefer familiarity with developing a site for both mobile and desktop, an understanding of server-side languages including NodeJS, and knowledge of code versioning tools such as Git and SVN. Any experience with GIS, C/C++, and/or other object-oriented languages is highly desirable. Due to the nature of the work (scientific programming for space related data), excellent math skills are also desired. A valid/clear driver's license is required.",
    "location": "San Antonio, TX",
    "employer": "Southwest Research Institute Inc."
  }
]